{
  "metadata": {
    "chapter": "frontiers",
    "version": "1.0.0",
    "generated": "2025-09-15T14:08:03.496790",
    "total_terms": 45,
    "standardized": true,
    "last_updated": "2025-09-21T00:00:00.000000"
  },
  "terms": [
    {
      "term": "agi",
      "definition": "Artificial General Intelligence - computational systems that match or exceed human cognitive capabilities across all domains of knowledge and reasoning, capable of generalizing across diverse problem domains without task-specific training.",
      "chapter_source": "frontiers",
      "aliases": ["artificial general intelligence"],
      "see_also": []
    },
    {
      "term": "artificial general intelligence",
      "definition": "A hypothetical form of AI that matches or exceeds human cognitive abilities across all domains, representing the ultimate goal of AI research beyond current narrow AI systems.",
      "chapter_source": "frontiers",
      "aliases": ["agi"],
      "see_also": []
    },
    {
      "term": "automl",
      "definition": "Automated machine learning that uses algorithms to automate the process of applying machine learning to real-world problems, including feature engineering, model selection, and hyperparameter tuning.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "brain-computer interface",
      "definition": "A direct communication pathway between the brain and an external device, enabling control of computers or prosthetics through neural signals and representing a convergence of ML with neurotechnology.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "compound ai systems",
      "definition": "AI architectures that combine multiple specialized models, tools, and components to achieve complex capabilities through systematic integration rather than relying on a single monolithic model.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "constitutional ai",
      "definition": "A training method where models learn to improve their own outputs by critiquing responses against a set of principles, enabling iterative self-refinement and reducing harmful content while maintaining helpfulness.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "continual learning",
      "definition": "The ability of machine learning systems to learn continuously from a stream of data while retaining previously acquired knowledge, addressing the challenge of catastrophic forgetting in neural networks.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "digital twin",
      "definition": "A virtual representation of a physical system that uses real-time data and machine learning to mirror, predict, and optimize the behavior of its physical counterpart.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "edge ai",
      "definition": "The deployment of artificial intelligence algorithms directly on edge devices like smartphones, IoT sensors, and embedded systems, enabling real-time processing without cloud connectivity.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "emergent capabilities",
      "definition": "Abilities that appear suddenly in neural networks at specific parameter thresholds, such as reasoning and arithmetic skills that emerge discontinuously rather than gradually improving with scale.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "explainable ai",
      "definition": "AI systems designed to provide clear, interpretable explanations for their decisions and predictions, addressing the \"black box\" problem of complex machine learning models.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "federated learning",
      "definition": "A distributed machine learning approach where models are trained across multiple decentralized devices or servers holding local data, without exchanging the raw data itself.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "foundation models",
      "definition": "Large-scale pre-trained models like GPT and BERT that can be adapted for a wide variety of downstream tasks, serving as a foundation for multiple applications.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "generative adversarial networks",
      "definition": "A class of machine learning systems where two neural networks compete against each other, with one generating fake data and the other trying to detect it, leading to highly realistic synthetic data generation.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "human-ai collaboration",
      "definition": "The synergistic partnership between humans and AI systems where each contributes their unique strengths to solve complex problems more effectively than either could alone.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "large language models",
      "definition": "Neural networks with billions or trillions of parameters trained on vast text corpora, capable of understanding and generating human-like text across diverse domains and tasks.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine consciousness",
      "definition": "The hypothetical emergence of conscious awareness in artificial systems, representing a frontier research area exploring whether machines can develop subjective experiences.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "meta-learning",
      "definition": "Learning algorithms that can learn how to learn, adapting quickly to new tasks with minimal training data by leveraging prior experience across related tasks.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multimodal ai",
      "definition": "AI systems that can process and understand multiple types of data simultaneously, such as text, images, audio, and video, enabling more comprehensive understanding and interaction.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neural architecture search",
      "definition": "Automated methods for designing optimal neural network architectures, using algorithms to explore the space of possible network designs and find the best performing structures.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "narrow ai",
      "definition": "AI systems designed to excel at specific, well-defined tasks but lacking the ability to generalize across diverse problem domains, in contrast to artificial general intelligence.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neuromorphic computing",
      "definition": "Computing architectures inspired by the structure and function of biological neural networks, designed to process information more efficiently than traditional digital computers.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "prompt engineering",
      "definition": "The practice of designing and optimizing text prompts to effectively communicate with large language models and achieve desired outputs from AI systems.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "quantum machine learning",
      "definition": "The intersection of quantum computing and machine learning, exploring how quantum algorithms and quantum computers can enhance or transform machine learning tasks.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "responsible ai",
      "definition": "The practice of developing and deploying AI systems in ways that are ethical, fair, transparent, and beneficial to society while minimizing potential harms and biases.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "rlhf",
      "definition": "Reinforcement Learning from Human Feedback - a training method that uses human preferences to guide model behavior, enabling AI systems to better align with human values and intentions.",
      "chapter_source": "frontiers",
      "aliases": ["reinforcement learning from human feedback"],
      "see_also": []
    },
    {
      "term": "scaling laws",
      "definition": "Mathematical relationships demonstrating power-law scaling between model size, dataset size, compute budget, and performance, suggesting predictable improvements with increased resources.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "self-supervised learning",
      "definition": "A machine learning paradigm where models learn representations from unlabeled data by predicting parts of the input from other parts, reducing dependence on manually labeled datasets.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "state space models",
      "definition": "Neural architectures that process sequences by maintaining compressed memory representations that update incrementally, offering linear scaling advantages over transformer attention mechanisms.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "swarm intelligence",
      "definition": "Collective intelligence emerging from decentralized, self-organized systems, often inspired by biological swarms and applied to distributed ML systems and robotics.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transfer learning",
      "definition": "A machine learning technique where knowledge gained from training on one task is applied to a different but related task, enabling faster learning with less data.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transformer architecture",
      "definition": "A neural network architecture based on attention mechanisms that has revolutionized natural language processing and is increasingly applied to other domains like computer vision.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "vision-language models",
      "definition": "AI systems that can understand and reason about both visual and textual information simultaneously, enabling tasks like image captioning, visual question answering, and multimodal understanding.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "zero-shot learning",
      "definition": "The ability of machine learning models to perform tasks or classify objects they have never seen during training, often achieved through sophisticated representation learning or large-scale pre-training.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mode collapse",
      "definition": "A failure mode in generative models where the model produces only a limited variety of outputs, ignoring the diversity present in the training data and failing to capture the full distribution.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mixture of experts",
      "definition": "An architectural approach that uses multiple specialized sub-models (experts) with a gating mechanism to route inputs to the most relevant experts, enabling efficient scaling while maintaining sparsity.",
      "chapter_source": "frontiers",
      "aliases": ["moe"],
      "see_also": []
    },
    {
      "term": "expert collapse",
      "definition": "A training pathology in mixture of experts models where only a few experts receive significant training signal, causing other experts to become underutilized and reducing the model's effective capacity.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "load balancing",
      "definition": "Techniques in mixture of experts models to ensure that computational load and training signal are distributed evenly across experts, preventing expert collapse and maintaining model efficiency.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "constitutional ai",
      "definition": "An approach to AI safety that trains models to follow a set of principles or 'constitution' that guide their behavior, helping ensure AI systems act in accordance with human values and ethical guidelines.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "self-refinement",
      "definition": "A training approach where models iteratively improve their own outputs by critiquing and refining their initial responses, enabling continuous improvement and better alignment with desired behaviors.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "selective computation",
      "definition": "Computational strategies that dynamically allocate processing resources based on input complexity or current needs, improving efficiency by avoiding unnecessary computation.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "external memory",
      "definition": "Mechanisms that allow neural networks to access and manipulate external storage systems, extending their working memory beyond parameter storage to enable more complex reasoning and information retrieval.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multi-agent approach",
      "definition": "Systems architecture where multiple AI agents collaborate, negotiate, or compete to solve complex problems, enabling division of labor and specialized expertise across different components.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "orchestration",
      "definition": "The coordination and management of multiple AI systems or agents working together, ensuring proper sequencing, communication, and resource allocation across distributed intelligence systems.",
      "chapter_source": "frontiers",
      "aliases": [],
      "see_also": []
    }
  ]
}
