{
  "metadata": {
    "title": "ML Systems Textbook - Master Glossary",
    "version": "1.0.0",
    "generated": "2025-09-23T23:13:27.468132",
    "total_terms": 654,
    "total_chapters": 21,
    "duplicate_terms_resolved": 107
  },
  "terms": [
    {
      "term": "3dmark",
      "definition": "Graphics performance benchmark suite that evaluates real-time 3D rendering capabilities, measuring triangle throughput, texture fill rates, and modern features like ray tracing and DLSS performance.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "a/b testing",
      "definition": "A controlled experimental method for comparing two versions of a system or model by randomly dividing users into groups and measuring performance differences between the variants.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "accountability",
      "definition": "The mechanisms by which individuals or organizations are held responsible for the outcomes of AI systems, involving traceability, documentation, auditing, and the ability to remedy harms.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "activation checkpointing",
      "definition": "A memory optimization technique that reduces memory usage during backpropagation by selectively discarding and recomputing activations instead of storing all intermediate results.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "activation function",
      "definition": "A mathematical function applied to the output of a neural network layer to introduce non-linearity, enabling the network to learn complex patterns. Common activation functions include ReLU, sigmoid, tanh, and softmax.",
      "chapters": [
        "dl_primer",
        "frameworks",
        "training",
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "activation-based pruning",
      "definition": "A pruning method that evaluates the average activation values of neurons or filters over a dataset to identify and remove neurons that consistently produce low activations and contribute little information to the network's decision process.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "active learning",
      "definition": "Iteratively selecting the most informative samples for labeling to maximize learning efficiency, achieving target performance with 50-90% less labeled data compared to random sampling strategies.",
      "chapters": [
        "data_engineering",
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "adam optimization",
      "definition": "An adaptive learning rate optimization algorithm that combines momentum and RMSprop by maintaining exponentially decaying averages of both gradients and squared gradients for each parameter.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "adapter modules",
      "definition": "Small trainable neural network components inserted between frozen layers of a pretrained model to enable lightweight adaptation without modifying the base architecture.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "adaptive resource pattern",
      "definition": "A design pattern that enables systems to dynamically adjust their operations in response to varying resource availability, ensuring efficiency and resilience by scaling up or down based on computational load, network bandwidth, and storage capacity.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "adversarial attack",
      "definition": "A type of attack where carefully crafted inputs are designed to cause machine learning models to make incorrect predictions while remaining nearly indistinguishable from legitimate data to humans.",
      "chapters": [
        "robust_ai",
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "adversarial example",
      "definition": "A maliciously modified input that is designed to fool a machine learning model into making an incorrect prediction, often created by adding small, imperceptible perturbations to legitimate data.",
      "chapters": [
        "robust_ai",
        "privacy_security",
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "adversarial training",
      "definition": "A defense technique that involves training models on adversarial examples to improve their robustness and ability to correctly classify adversarial inputs.",
      "chapters": [
        "robust_ai",
        "privacy_security",
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "agi",
      "definition": "Artificial General Intelligence - computational systems that match or exceed human cognitive capabilities across all domains of knowledge and reasoning, capable of generalizing across diverse problem domains without task-specific training.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [
        "artificial general intelligence"
      ],
      "see_also": []
    },
    {
      "term": "ai for good",
      "definition": "The design, development, and deployment of machine learning systems aimed at addressing important societal and environmental challenges to enhance human welfare, promote sustainability, and contribute to global development goals.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "alerting",
      "definition": "Automated notification systems that inform teams when metrics exceed predefined thresholds or anomalies are detected in production ML systems.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "alexnet",
      "definition": "A breakthrough deep neural network from 2012 that won the ImageNet competition by a large margin and helped spark the deep learning revolution, proving that neural networks could outperform traditional computer vision methods when given enough data and computing power.",
      "chapters": [
        "introduction",
        "dnn_architectures",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "algorithmic efficiency",
      "definition": "The design and optimization of algorithms to maximize performance within given resource constraints, focusing on techniques like model compression, architectural optimization, and algorithmic refinement.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "algorithmic fairness",
      "definition": "The principle that automated systems should not disproportionately disadvantage individuals or groups based on protected attributes such as race, gender, or age.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "all-reduce",
      "definition": "A collective communication operation in distributed computing where each process contributes data and all processes receive the combined result, commonly used for gradient aggregation in distributed training.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "alphafold",
      "definition": "A landmark AI system developed by DeepMind that predicts the three-dimensional structure of proteins from their amino acid sequences, solving the decades-old \"protein folding problem\" and demonstrating how large-scale ML systems can accelerate scientific discovery.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "anomaly detection",
      "definition": "The identification of patterns in data that do not conform to expected behavior, often used to detect outliers, faults, or malicious activities in systems.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "anonymization",
      "definition": "The process of removing or modifying personally identifiable information from datasets to protect individual privacy, though often insufficient against sophisticated re-identification attacks.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "apache kafka",
      "definition": "A distributed streaming platform that handles real-time data feeds using a publish-subscribe messaging system, commonly used for building ML data pipelines with high throughput and fault tolerance.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "apache spark",
      "definition": "An open-source distributed computing framework that enables large-scale data processing across clusters of computers, revolutionizing ETL operations with in-memory computing capabilities.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "application-specific integrated circuit",
      "definition": "A specialized chip designed for specific tasks that offers maximum efficiency by abandoning general-purpose flexibility, exemplified by Cerebras Wafer-Scale Engine for machine learning training.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "application-specific integrated circuit (asic)",
      "definition": "Custom chips designed for specific computational tasks that offer superior performance and energy efficiency compared to general-purpose processors, exemplified by Google's TPUs and Bitcoin mining ASICs.",
      "chapters": [
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "architectural efficiency",
      "definition": "The dimension of model optimization that focuses on how computations are performed efficiently during training and inference by exploiting sparsity, factorizing large components, and dynamically adjusting computation based on input complexity.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "artificial general intelligence",
      "definition": "A hypothetical form of AI that matches or exceeds human cognitive abilities across all domains, representing the ultimate goal of AI research beyond current narrow AI systems.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [
        "agi"
      ],
      "see_also": []
    },
    {
      "term": "artificial intelligence",
      "definition": "The systematic pursuit of understanding and replicating intelligent behavior through the development of computer systems that can perform tasks typically requiring human intelligence, such as learning, problem-solving, perception, and decision-making.",
      "chapters": [
        "introduction",
        "dl_primer",
        "ml_systems",
        "benchmarking",
        "responsible_ai",
        "sustainable_ai",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "artificial neural network",
      "definition": "A computational model inspired by biological neural networks, consisting of interconnected nodes (neurons) organized in layers that can learn patterns from data through adjustable weights and biases.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "artificial neurons",
      "definition": "Basic computational units in neural networks that mimic biological neurons, taking multiple inputs, applying weights and biases, and producing an output signal through an activation function.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "attack taxonomy",
      "definition": "Systematic classification of cybersecurity threats and adversarial attacks against ML systems, organizing threats by method, target, and impact to guide defense strategies.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "attention mechanism",
      "definition": "A neural network component that computes weighted connections between elements based on their content, allowing dynamic focus on relevant parts of the input rather than fixed architectural connections.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "autoencoder",
      "definition": "A neural network architecture that learns compressed data representations by minimizing reconstruction error, commonly used for anomaly detection and dimensionality reduction.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "automatic differentiation",
      "definition": "A computational technique that automatically calculates exact derivatives of functions implemented as computer programs by systematically applying the chain rule at the elementary operation level, essential for training neural networks through gradient-based optimization.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "automatic mixed precision",
      "definition": "A training technique that automatically manages the use of different numerical precisions (FP16, FP32) to optimize memory usage and computational speed while maintaining model accuracy.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "automation bias",
      "definition": "The tendency for humans to over-rely on automated system outputs even when clear errors are present, potentially compromising human oversight.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "automl",
      "definition": "Automated Machine Learning that uses machine learning itself to automate model design decisions, including architecture search, hyperparameter optimization, and feature selection to create efficient models without manual intervention.",
      "chapters": [
        "optimizations",
        "efficient_ai",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "autoregressive",
      "definition": "Models that generate sequences by predicting the next element based on previous elements, such as GPT models that generate text one token at a time.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "autoscaling",
      "definition": "Dynamic adjustment of compute resources based on workload demand, automatically scaling up during peak usage and scaling down during low usage to optimize costs and performance.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "availability attack",
      "definition": "A type of data poisoning attack that aims to degrade the overall performance of a machine learning model by introducing noise or corrupting training data across multiple classes.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "backdoor attack",
      "definition": "A type of data poisoning where hidden triggers are embedded in training data, causing models to behave maliciously when specific patterns are encountered during inference.",
      "chapters": [
        "robust_ai",
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "backpropagation",
      "definition": "The algorithm used to train neural networks by computing gradients of the loss function with respect to network parameters through reverse-mode automatic differentiation, enabling efficient parameter updates during training.",
      "chapters": [
        "dl_primer",
        "frameworks",
        "training",
        "dnn_architectures",
        "ondevice_learning",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bandwidth",
      "definition": "The maximum rate of data transfer across a communication channel or memory interface, typically measured in bytes per second and critical for optimizing data movement in AI accelerators.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batch inference",
      "definition": "Processing large volumes of data predictions asynchronously in scheduled batches rather than real-time, suitable for non-interactive applications like reporting or analytics.",
      "chapters": [
        "ml_systems",
        "benchmarking",
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batch ingestion",
      "definition": "A data processing pattern that collects and processes data in groups or batches at scheduled intervals, suitable for scenarios where real-time processing is not critical.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batch normalization",
      "definition": "A technique that normalizes the inputs to each layer during training, reducing internal covariate shift and allowing higher learning rates while improving training stability and speed.",
      "chapters": [
        "frameworks",
        "training",
        "training",
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batch processing",
      "definition": "The technique of processing multiple data samples simultaneously to amortize computation and memory access costs, improving overall throughput in neural network training and inference.",
      "chapters": [
        "data_engineering",
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batch size",
      "definition": "The number of training examples processed simultaneously during one iteration of neural network training, affecting both computational efficiency and gradient estimation quality.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batch throughput optimization",
      "definition": "Techniques for maximizing the number of samples processed per unit time when handling multiple inputs simultaneously, leveraging parallelism and batching efficiencies.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "batched operations",
      "definition": "Matrix computations that process multiple inputs simultaneously, converting matrix-vector operations into more efficient matrix-matrix operations to improve hardware utilization.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bayesian neural networks",
      "definition": "Neural networks that incorporate probability distributions over their weights, enabling uncertainty quantification in predictions and more robust decision making.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "benchmark engineering",
      "definition": "The systematic design and development of performance evaluation frameworks, involving test harness creation, metric selection, and result interpretation methodologies.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "benchmark harness",
      "definition": "Systematic infrastructure component that controls test execution, manages input delivery, and collects performance measurements under controlled conditions to ensure reproducible evaluations.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "benchmarking",
      "definition": "Systematic evaluation of compute performance, algorithmic effectiveness, and data quality in machine learning systems to optimize performance across diverse workloads and ensure reproducibility.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bert",
      "definition": "Bidirectional Encoder Representations from Transformers, a transformer-based language model introduced by Google in 2018 that revolutionized natural language processing through masked language modeling pre-training.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bfloat16",
      "definition": "A 16-bit floating-point format developed by Google Brain that maintains the same dynamic range as FP32 but with reduced precision, making it particularly suitable for deep learning training.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bias",
      "definition": "A learnable parameter added to the weighted sum in each neuron that allows the activation function to shift, providing additional flexibility for the network to fit complex patterns.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bias detection",
      "definition": "Systematic methods for identifying unfair discrimination or disparate treatment across different demographic groups in machine learning system outputs.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bias mitigation",
      "definition": "Techniques and interventions designed to reduce unfair discrimination in machine learning systems, applied during data collection, model training, or post-processing stages.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bias terms",
      "definition": "Learnable parameters in neural networks that shift the activation function, allowing neurons to activate even when all inputs are zero, providing additional flexibility for fitting complex patterns.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bias-only adaptation",
      "definition": "A lightweight training strategy that freezes all model weights and updates only scalar bias terms, drastically reducing memory requirements and computational overhead for on-device learning.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "binarization",
      "definition": "An extreme quantization technique that reduces neural network weights and activations to binary values (typically -1 and +1), achieving maximum compression but often requiring specialized training procedures and hardware support.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "biodiversity monitoring",
      "definition": "The systematic observation and measurement of biological diversity using technology such as camera traps and sensor networks to track species populations, habitat changes, and conservation effectiveness.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "biological neuron",
      "definition": "A cell in the nervous system that receives, processes, and transmits information through electrical and chemical signals, serving as inspiration for artificial neural networks.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bit flip",
      "definition": "A hardware fault where a single bit in memory or a register unexpectedly changes its value from 0 to 1 or vice versa, potentially corrupting data or computations.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "black box",
      "definition": "A system where you can observe the inputs and outputs but cannot see or understand the internal workings, particularly problematic in AI when systems make important decisions affecting people's lives without providing explanations for their reasoning.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "black-box attack",
      "definition": "An adversarial attack where the attacker has no knowledge of the model's internal architecture, parameters, or training data, and must rely solely on querying the model and observing outputs.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "blas",
      "definition": "Basic Linear Algebra Subprograms, a specification for low-level routines that perform common linear algebra operations such as vector addition, scalar multiplication, dot products, and matrix operations, forming the computational foundation of modern ML frameworks.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bounding box",
      "definition": "A rectangular annotation that identifies object locations in images by drawing a box around each object of interest, commonly used in computer vision training datasets.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "brain-computer interface",
      "definition": "A direct communication pathway between the brain and an external device, enabling control of computers or prosthetics through neural signals and representing a convergence of ML with neurotechnology.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "brittleness",
      "definition": "The tendency of rule-based AI systems to fail completely when encountering inputs that fall outside their programmed scenarios, no matter how similar those inputs might be to what they were designed to handle.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "built-in self-test (bist)",
      "definition": "Hardware testing mechanisms that allow components to test themselves for faults using dedicated circuitry and predefined test patterns.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cache timing attack",
      "definition": "A type of side-channel attack that exploits variations in memory cache access patterns to infer sensitive information about program execution or data.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "caching",
      "definition": "A technique for storing frequently accessed data in high-speed storage systems to reduce retrieval latency and improve system performance in ML pipelines.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "calibration",
      "definition": "The process in post-training quantization of analyzing a representative dataset to determine optimal quantization parameters, including scale factors and zero points, that minimize accuracy loss when converting from high to low precision.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "canary deployment",
      "definition": "Gradual rollout strategy where a new model version serves a small percentage of traffic while monitoring performance before full deployment, allowing safe validation in production.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "carbon footprint",
      "definition": "The total amount of greenhouse gas emissions produced directly and indirectly by an individual, organization, event, or product, typically measured in CO2 equivalent.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "carbon-aware scheduling",
      "definition": "A computational approach that schedules AI workloads based on the carbon intensity of the electricity grid, prioritizing execution when renewable energy sources are most available.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "catastrophic forgetting",
      "definition": "The phenomenon where neural networks lose previously learned knowledge when adapting to new tasks, a critical challenge in continual on-device learning scenarios.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cerebras wafer-scale engine",
      "definition": "A revolutionary single-wafer processor containing 2.6 trillion transistors and 850,000 cores, designed to eliminate inter-device communication bottlenecks in large-scale machine learning training.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "channelwise quantization",
      "definition": "A quantization granularity approach where each channel in a layer uses its own set of quantization parameters, providing more precise representation than layerwise quantization while maintaining hardware efficiency.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "checkpoint and restart mechanisms",
      "definition": "Techniques that periodically save a program's state so it can resume from the last saved state after a failure, improving system resilience.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "ci/cd pipelines",
      "definition": "Continuous Integration and Continuous Delivery automated workflows that streamline model development by integrating testing, validation, and deployment processes.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cifar10",
      "definition": "Canadian Institute for Advanced Research dataset with 60,000 32×32 color images across 10 classes, serving as a standard benchmark in computer vision despite its small image size by modern standards.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "classification labels",
      "definition": "Simple categorical annotations that assign specific tags or categories to data examples, representing the most basic form of supervised learning annotation.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "client scheduling",
      "definition": "The process of selecting which devices participate in federated learning rounds based on availability, data quality, and resource constraints to ensure representative model updates.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cloud ml",
      "definition": "Machine learning systems that leverage cloud computing infrastructure to provide scalable computational resources for training and inference, typically offering high-bandwidth connectivity and substantial processing power.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cloudsuite",
      "definition": "Benchmark suite developed at EPFL that addresses modern datacenter workloads including web search, data analytics, and media streaming, measuring end-to-end performance across network, storage, and compute dimensions.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "co design",
      "definition": "Holistic approach where model architectures, hardware platforms, and data pipelines are designed in tandem to work seamlessly together, mitigating trade-offs through end-to-end optimization.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cold-start performance",
      "definition": "Time required for a system to transition from idle state to active execution, particularly important in serverless environments where models are loaded on demand.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "combinational logic",
      "definition": "Digital logic circuits where the output depends only on the current input states, not any past states or memory elements.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "compound ai systems",
      "definition": "AI architectures that combine multiple specialized models, tools, and components to achieve complex capabilities through systematic integration rather than relying on a single monolithic model.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "computational graph",
      "definition": "A directed acyclic graph representation of mathematical operations where nodes represent operations or variables and edges represent data flow, enabling automatic differentiation and optimization of neural network computations.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "compute efficiency",
      "definition": "The optimization of computational resources including hardware and energy utilization to maximize processing speed while minimizing resource consumption during training and deployment.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "compute-optimal training",
      "definition": "Training strategies that optimally balance model size and training compute budget according to scaling laws, achieving maximum performance for a given computational budget.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "computer engineering",
      "definition": "An engineering discipline that emerged in the late 1960s to address the growing complexity of integrating hardware and software systems, combining expertise from electrical engineering and computer science to design and build complex computing systems.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "concept bottleneck models",
      "definition": "Neural network architectures that first predict interpretable intermediate concepts before making final predictions, combining deep learning power with transparency.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "concept drift",
      "definition": "Performance degradation that occurs when the underlying relationship between input features and target outcomes changes over time, requiring model retraining.",
      "chapters": [
        "ops",
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "conditional computation",
      "definition": "A dynamic optimization technique where different parts of a neural network are selectively activated based on input characteristics, reducing computational load by skipping unnecessary computations for specific inputs.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "connectionism",
      "definition": "An approach to AI modeling that emphasizes learning and intelligence emerging from simple interconnected units, serving as the theoretical foundation for neural networks and contrasting with symbolic AI approaches.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "consensus labeling",
      "definition": "A quality control approach that collects multiple annotations for the same data point to identify controversial cases and improve label reliability through inter-annotator agreement.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "conservation technology",
      "definition": "Technological solutions designed to protect and monitor wildlife and ecosystems, including camera traps, sensor networks, and satellite monitoring systems for tracking animal behavior and detecting threats.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "constitutional ai",
      "definition": "A training method where models learn to improve their own outputs by critiquing responses against a set of principles, enabling iterative self-refinement and reducing harmful content while maintaining helpfulness.",
      "chapters": [
        "frontiers",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "containerization",
      "definition": "Packaging applications and their dependencies into portable, isolated containers using tools like Docker to ensure consistent execution across different environments.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "containerized microservices",
      "definition": "Architectural pattern using lightweight containers to package individual services, enabling scalable, maintainable deployment of ML systems across distributed environments.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "continual learning",
      "definition": "The ability of machine learning systems to learn continuously from a stream of data while retaining previously acquired knowledge, addressing the challenge of catastrophic forgetting in neural networks.",
      "chapters": [
        "ondevice_learning",
        "robust_ai",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "continuous integration",
      "definition": "A software development practice where code changes are automatically integrated, tested, and validated multiple times per day to detect issues early in the development cycle.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "convolution",
      "definition": "A mathematical operation fundamental to convolutional neural networks that applies filters (kernels) to input data to extract features such as edges, textures, or patterns, particularly effective for processing images and spatial data.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "convolution operation",
      "definition": "A mathematical operation that slides a filter (kernel) across input data to detect local features, forming the foundation of convolutional neural networks for spatial pattern recognition.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "convolutional neural network",
      "definition": "A type of neural network architecture designed for processing spatial data like images, using convolutional layers with local receptive fields and weight sharing to detect spatial patterns.",
      "chapters": [
        "dl_primer",
        "dnn_architectures",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cooling effectiveness",
      "definition": "The efficiency with which a data center cooling system removes heat from computing equipment, typically measured as the ratio of heat removed to energy consumed for cooling.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "counterfactual explanations",
      "definition": "Explanations that describe how a model's output would change if specific input features were modified, particularly useful for understanding decision boundaries.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "covariate shift",
      "definition": "A type of distribution shift where the input distribution changes while the conditional relationship between inputs and outputs remains stable.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cp decomposition",
      "definition": "CANDECOMP/PARAFAC decomposition that expresses a tensor as a sum of rank-one components, used to compress neural network layers by reducing the number of parameters while preserving computational functionality.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "crisp-dm",
      "definition": "Cross-Industry Standard Process for Data Mining, a structured methodology developed in 1996 that defines six phases for data projects: business understanding, data understanding, data preparation, modeling, evaluation, and deployment.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cross-entropy loss",
      "definition": "A loss function commonly used in classification tasks that measures the difference between predicted probability distributions and true class labels, providing strong gradients for effective learning.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "crowdsourcing",
      "definition": "A collaborative data collection approach that leverages distributed individuals via the internet to perform annotation tasks, enabling scalable dataset creation through platforms like Amazon Mechanical Turk.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cublas",
      "definition": "NVIDIA's CUDA Basic Linear Algebra Subprograms library that provides GPU-accelerated implementations of standard linear algebra operations, enabling high-performance matrix computations on NVIDIA graphics processing units.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cuda",
      "definition": "NVIDIA's parallel computing platform and programming model that enables general-purpose computing on graphics processing units (GPUs), allowing machine learning frameworks to leverage massive parallelism for accelerated tensor operations.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "cuda (compute unified device architecture)",
      "definition": "NVIDIA's parallel computing platform and programming model that enables developers to use GPUs for general-purpose computing beyond graphics rendering.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "curriculum learning",
      "definition": "Training strategy where models learn from easy examples before progressing to harder ones, mimicking human education and improving convergence speed by 25-50%.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dartmouth conference",
      "definition": "The legendary 8-week workshop at Dartmouth College in 1956 where AI was officially born, organized by John McCarthy, Marvin Minsky, Nathaniel Rochester, and Claude Shannon, where the term \"artificial intelligence\" was first coined.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data augmentation",
      "definition": "Artificially expanding datasets through transformations like rotations, crops, or noise to improve model performance by 5-15% and reduce overfitting when labeled data is scarce.",
      "chapters": [
        "data_engineering",
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data cascades",
      "definition": "Systemic failures where data quality issues compound over time, creating downstream negative consequences such as model failures, costly rebuilding, or project termination.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data center",
      "definition": "A facility housing computer systems and associated components such as telecommunications and storage systems, typically including redundant power supplies, cooling systems, and network connections.",
      "chapters": [
        "ml_systems",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data centric ai",
      "definition": "Paradigm shift from model-centric to data-centric development that focuses on systematically improving data quality rather than just model architecture, often yielding greater performance gains.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data compression",
      "definition": "Techniques for reducing the size and complexity of training data through encoding, quantization, or feature extraction to enable efficient storage and processing on memory-constrained devices.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data curation",
      "definition": "The process of selecting, organizing, and maintaining high-quality datasets by removing irrelevant information, correcting errors, and ensuring data meets specific standards for machine learning applications.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data drift",
      "definition": "The phenomenon where the statistical properties of input data change over time, causing machine learning model performance to degrade even when the underlying code remains unchanged.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data efficiency",
      "definition": "Optimizing the amount and quality of data required to train machine learning models effectively, focusing on maximizing information gained while minimizing required data volume.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data governance",
      "definition": "The framework of policies, procedures, and technologies that ensure data security, privacy, compliance, and ethical use throughout the machine learning pipeline.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data ingestion",
      "definition": "The process of collecting and importing raw data from various sources into a system where it can be stored, processed, and prepared for machine learning applications.",
      "chapters": [
        "data_engineering",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data lake",
      "definition": "A storage repository that holds structured, semi-structured, and unstructured data in its native format, using schema-on-read approaches for flexible data analysis.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data lineage",
      "definition": "The documentation and tracking of data flow through various transformations and processes, providing visibility into data origins and modifications for compliance and debugging.",
      "chapters": [
        "data_engineering",
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data parallelism",
      "definition": "A distributed computing strategy that partitions training data across multiple devices while maintaining identical model copies on each device, enabling efficient scaling of training by processing different data batches simultaneously.",
      "chapters": [
        "frameworks",
        "training",
        "efficient_ai",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data pipeline",
      "definition": "The infrastructure and workflows that automate the movement and transformation of data from sources through processing stages to final storage or consumption.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data poisoning",
      "definition": "An attack method where adversaries inject carefully crafted malicious data points into the training dataset to manipulate model behavior in targeted or systematic ways.",
      "chapters": [
        "robust_ai",
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data quality",
      "definition": "The degree to which data meets requirements for accuracy, completeness, consistency, and timeliness, directly impacting machine learning model performance.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data sanitization",
      "definition": "The process of deliberately and permanently removing or destroying data stored on memory devices to make it unrecoverable, ensuring data security.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data scaling regimes",
      "definition": "Different phases of model training where data requirements scale according to predictable patterns, informing decisions about dataset size versus computational investment.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data validation",
      "definition": "The systematic verification that collected data meets quality standards, is properly formatted, and contains accurate information suitable for machine learning model training and evaluation.",
      "chapters": [
        "data_engineering",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data versioning",
      "definition": "The practice of tracking and managing different versions of datasets over time, similar to code versioning, to ensure reproducibility and enable rollback to previous data states when needed.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data warehouse",
      "definition": "A centralized repository optimized for analytical queries (OLAP) that stores integrated, structured data from multiple sources in a standardized schema.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "data-centric approach",
      "definition": "A machine learning paradigm that prioritizes improving data quality, diversity, and curation rather than solely focusing on model architecture improvements to achieve better performance.",
      "chapters": [
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dataflow architecture",
      "definition": "Specialized computing architecture where instruction execution is determined by data availability rather than a program counter, enabling highly parallel processing of neural network operations.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dataflow challenges",
      "definition": "Technical difficulties in managing data movement and dependencies in hardware accelerators, including memory bandwidth limitations and synchronization requirements.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dead letter queue",
      "definition": "A separate storage mechanism for data that fails processing, allowing for later analysis and potential reprocessing of problematic data without blocking the main pipeline.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "deep learning",
      "definition": "A subfield of machine learning that uses artificial neural networks with multiple layers to automatically learn hierarchical representations from data without explicit feature engineering.",
      "chapters": [
        "dl_primer",
        "dnn_architectures",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "defensive distillation",
      "definition": "A technique that trains a student model to mimic a teacher model's behavior using soft labels, reducing sensitivity to adversarial perturbations.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "demographic parity",
      "definition": "A fairness criterion requiring that the probability of receiving a positive prediction is independent of group membership across protected attributes.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dennard scaling",
      "definition": "The historical observation that as transistors become smaller, their power density remains approximately constant, allowing for more transistors without proportional increases in power consumption.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dense layer",
      "definition": "A fully-connected neural network layer where each neuron receives input from all neurons in the previous layer, enabling comprehensive information integration across features.",
      "chapters": [
        "dl_primer",
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dense matrix-matrix multiplication",
      "definition": "The fundamental computational operation in neural networks that dominates training time, accounting for 60-90% of computation in typical models.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "deployment constraints",
      "definition": "Operational limitations such as hardware resources, network connectivity, regulatory requirements, and integration requirements that influence how machine learning models are implemented in production environments.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "depthwise separable convolutions",
      "definition": "A computational technique that decomposes standard convolutions into depthwise and pointwise operations, reducing parameters and computation by 8-9x for mobile-optimized architectures.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "devops",
      "definition": "Software development practice that combines development and operations teams to shorten development cycles and deliver high-quality software through automation and collaboration.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dhrystone",
      "definition": "Integer-based benchmark introduced in 1984 that measures integer and string operations in DMIPS (Dhrystone MIPS), designed to complement floating-point benchmarks with typical programming constructs.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "diabetic retinopathy",
      "definition": "A diabetes complication that damages blood vessels in the retina, serving as a leading cause of preventable blindness and a key application area for medical AI screening systems.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "differential privacy",
      "definition": "A mathematical framework that provides formal privacy guarantees by adding calibrated noise to computations, ensuring that the inclusion or exclusion of any individual's data has a provably limited effect on the output.",
      "chapters": [
        "data_engineering",
        "ondevice_learning",
        "privacy_security",
        "responsible_ai",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "digital divide",
      "definition": "The gap between those who have access to modern information and communication technology and those who do not, particularly affecting underserved communities' ability to benefit from digital solutions.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "digital twin",
      "definition": "A virtual representation of a physical system that uses real-time data and machine learning to mirror, predict, and optimize the behavior of its physical counterpart.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "disaster response systems",
      "definition": "Automated systems that use machine learning to detect, predict, and respond to natural disasters through satellite imagery analysis, sensor networks, and resource allocation optimization.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distributed computing",
      "definition": "An approach that processes data across multiple machines or processors simultaneously, enabling scalable handling of large datasets through frameworks like Apache Spark.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distributed intelligence",
      "definition": "The placement of computational capabilities across multiple devices and locations rather than relying on a single centralized system, enabling local processing and decision-making.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distributed knowledge pattern",
      "definition": "A design pattern that addresses collective learning and inference across decentralized nodes, emphasizing peer-to-peer knowledge sharing and collaborative model improvement while maintaining operational independence.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distributed training",
      "definition": "Training neural networks across multiple devices or machines, using strategies like data parallelism, model parallelism, or pipeline parallelism to handle larger models and datasets efficiently.",
      "chapters": [
        "training",
        "training",
        "benchmarking",
        "sustainable_ai",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distribution shift",
      "definition": "The phenomenon where data encountered during model deployment differs from the training distribution, potentially degrading model performance.",
      "chapters": [
        "robust_ai",
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distribution shift types",
      "definition": "Formal categorization of changes in data distributions including covariate shift, label shift, concept drift, and domain shift, each requiring specific adaptation techniques.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "domain adaptation",
      "definition": "Machine learning techniques that enable models trained on one domain to perform well on a different but related domain, addressing distribution mismatch challenges.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "domain-specific ai applications",
      "definition": "Machine learning solutions tailored to specific sectors like healthcare, agriculture, education, or disaster response, designed to address unique challenges and constraints.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "domain-specific architecture",
      "definition": "Hardware designs tailored to optimize specific computational workloads, trading flexibility for improved performance and energy efficiency compared to general-purpose processors.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "double modular redundancy (dmr)",
      "definition": "A fault-tolerance technique where computations are duplicated across two independent systems to identify and correct errors through comparison.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dropout",
      "definition": "A regularization technique that randomly sets a fraction of input units to zero during training to prevent overfitting and improve generalization.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dual-use dilemma",
      "definition": "The challenge of mitigating misuse of technology that has both positive and negative potential applications, particularly relevant in AI security.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dying relu problem",
      "definition": "A phenomenon where ReLU neurons become permanently inactive and output zero for all inputs, preventing them from contributing to learning when weighted inputs consistently produce negative values.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dynamic graph",
      "definition": "A computational graph that is built and modified during program execution, allowing for flexible model architectures and easier debugging but potentially limiting optimization opportunities compared to static graphs.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dynamic pruning",
      "definition": "A model optimization technique that removes unnecessary parameters from neural networks while maintaining predictive performance, reducing model size and computational cost by eliminating redundant weights, neurons, or layers.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dynamic quantization",
      "definition": "The process of reducing numerical precision in neural networks by mapping high-precision weights and activations to lower-bit representations, significantly reducing memory usage and computational requirements.",
      "chapters": [
        "optimizations",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dynamic random access memory (dram)",
      "definition": "A type of volatile memory that stores data in capacitors and requires periodic refresh cycles, commonly used as main memory in computer systems.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "dynamic voltage and frequency scaling (dvfs)",
      "definition": "Power management technique that adjusts processor voltage and clock frequency based on workload demands to optimize energy consumption while maintaining performance.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "eager execution",
      "definition": "An execution mode where operations are evaluated immediately as they are called in the code, providing intuitive debugging and development experience but potentially sacrificing some optimization opportunities available in graph-based execution.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "early exit architectures",
      "definition": "Neural network designs that include multiple prediction heads at different depths, allowing samples to exit early when confident predictions can be made, reducing average computational cost per inference.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "edge ai",
      "definition": "The deployment of artificial intelligence algorithms directly on edge devices like smartphones, IoT sensors, and embedded systems, enabling real-time processing without cloud connectivity.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "edge computing",
      "definition": "A distributed computing paradigm that brings computation and data storage closer to data sources, enabling real-time processing with reduced latency and lower bandwidth requirements.",
      "chapters": [
        "ml_systems",
        "hw_acceleration",
        "ondevice_learning",
        "sustainable_ai",
        "ai_for_good",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "edge deployment",
      "definition": "A deployment strategy where machine learning models run locally on devices at the network edge rather than in centralized cloud servers, reducing latency and enabling operation without constant internet connectivity.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "edge ml",
      "definition": "Machine learning systems that perform inference and sometimes training at the edge of networks, typically on resource-constrained devices like smartphones or embedded systems with limited computational power.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "edge training",
      "definition": "The process of training or fine-tuning machine learning models directly on edge devices, enabling personalization and adaptation without requiring data transmission to cloud servers.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "efficientnet",
      "definition": "A family of neural network architectures discovered through Neural Architecture Search that achieves better accuracy-efficiency trade-offs by using compound scaling to balance network depth, width, and input resolution.",
      "chapters": [
        "optimizations",
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "electromigration",
      "definition": "The movement of metal atoms in a conductor under the influence of an electric field, potentially causing permanent hardware faults over time.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "eliza",
      "definition": "One of the first chatbots created by MIT's Joseph Weizenbaum in 1966 that could simulate human conversation through pattern matching and substitution, notable because people began forming emotional attachments to this simple program.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "elt (extract, load, transform)",
      "definition": "A data processing paradigm that first loads raw data into the target system before applying transformations, providing flexibility for evolving analytical needs.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "embedded systems",
      "definition": "Computer systems with dedicated functions within larger mechanical or electrical systems, typically designed for specific tasks with real-time computing constraints.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "embodied carbon",
      "definition": "The total greenhouse gas emissions generated during the manufacturing, transportation, and installation of a product before it begins operation.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "emergent behaviors",
      "definition": "Unexpected system-wide patterns or characteristics that arise from the interaction of individual components, often becoming apparent only when systems operate at scale or in real-world conditions.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "emergent capabilities",
      "definition": "Abilities that appear suddenly in neural networks at specific parameter thresholds, such as reasoning and arithmetic skills that emerge discontinuously rather than gradually improving with scale.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "encoder-decoder",
      "definition": "An architectural pattern where an encoder processes input into a compressed representation and a decoder generates output from this representation, commonly used in sequence-to-sequence tasks.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "end-to-end benchmarks",
      "definition": "Comprehensive evaluation methodology that assesses entire AI system pipelines including data processing, model execution, post-processing, and infrastructure components.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "energy efficiency",
      "definition": "The measure of computational work performed per unit of energy consumed, typically expressed as operations per joule and crucial for battery-powered and data center deployments.",
      "chapters": [
        "hw_acceleration",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "energy star",
      "definition": "EPA certification program that establishes energy efficiency standards for computing equipment, requiring systems to meet strict efficiency requirements during operation and sleep modes.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "ensemble methods",
      "definition": "Techniques combining multiple models to improve performance, like Random Forest and Gradient Boosting, which dominated machine learning competitions before deep learning.",
      "chapters": [
        "efficient_ai",
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "environmental impact measurement",
      "definition": "Systematic tracking and quantification of the ecological effects of AI systems, including energy consumption, carbon emissions, and resource depletion across the complete system lifecycle.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "environmental monitoring",
      "definition": "The systematic collection and analysis of environmental data using sensor networks and machine learning to track ecosystem health, pollution levels, and climate change impacts.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "epoch",
      "definition": "One complete pass through the entire training dataset during neural network training, consisting of multiple batch iterations depending on dataset size and batch size.",
      "chapters": [
        "dl_primer",
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "equality of opportunity",
      "definition": "A fairness criterion focused on ensuring equal true positive rates across groups, guaranteeing that qualified individuals are treated equally regardless of group membership.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "equalized odds",
      "definition": "A fairness definition requiring that true positive and false positive rates are equal across different demographic groups.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "error-correcting codes",
      "definition": "Methods used in data storage and transmission to detect and correct errors, improving system reliability and data integrity.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "esp32",
      "definition": "A low-cost microcontroller unit widely used in IoT applications, featuring a 240 MHz processor and 520 KB of RAM, commonly deployed in resource-constrained social impact applications.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "etl (extract, transform, load)",
      "definition": "A traditional data processing paradigm that transforms data before loading it into a data warehouse, resulting in ready-to-query formatted data.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "exact model theft",
      "definition": "An attack that aims to extract the precise internal structure, parameters, and architecture of a machine learning model, allowing complete reproduction of the original model.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "experience replay",
      "definition": "A memory-based technique that stores past training examples in a buffer to prevent catastrophic forgetting and stabilize learning in streaming or continual adaptation scenarios.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "experiment tracking",
      "definition": "The systematic recording and management of machine learning experiments, including hyperparameters, model versions, training data, and performance metrics, to enable comparison and reproducibility.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "expert collapse",
      "definition": "A training pathology in mixture of experts models where only a few experts receive significant training signal, causing other experts to become underutilized and reducing the model's effective capacity.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "expert systems",
      "definition": "AI systems from the mid-1970s that captured human expert knowledge in specific domains, exemplified by MYCIN for diagnosing blood infections, representing a shift from general AI to domain-specific applications.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "explainability",
      "definition": "The ability of stakeholders to understand how a machine learning model produces its outputs through post-hoc explanation techniques.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "explainable ai",
      "definition": "AI systems designed to provide clear, interpretable explanations for their decisions and predictions, addressing the \"black box\" problem of complex machine learning models.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "external memory",
      "definition": "Mechanisms that allow neural networks to access and manipulate external storage systems, extending their working memory beyond parameter storage to enable more complex reasoning and information retrieval.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "f1 score",
      "definition": "A measure of model accuracy that combines precision and recall into a single metric, calculated as their harmonic mean.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fairness constraints",
      "definition": "Technical and policy restrictions designed to ensure equitable treatment across demographic groups in machine learning systems.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "farmbeats",
      "definition": "A Microsoft Research project that applies machine learning and IoT technologies to agriculture, using edge computing to collect real-time data on soil conditions and crop health while demonstrating distributed AI systems in challenging real-world environments.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fast gradient sign method (fgsm)",
      "definition": "A gradient-based adversarial attack that generates adversarial examples by adding small perturbations in the direction of the gradient.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fault injection attack",
      "definition": "A physical attack that deliberately disrupts hardware operations through techniques like voltage manipulation or electromagnetic interference to induce computational errors and compromise system integrity.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fault tolerance",
      "definition": "The ability of a system to continue operating correctly even when some of its components fail or encounter errors.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "feature engineering",
      "definition": "The process of manually designing and extracting relevant features from raw data to improve machine learning model performance, largely automated in deep learning systems.",
      "chapters": [
        "dl_primer",
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "feature map",
      "definition": "The output of a convolutional layer representing the response of learned filters to different spatial locations in the input, capturing detected features at various positions.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "feature store",
      "definition": "A specialized data storage system that provides standardized, reusable features for machine learning, enabling feature sharing across multiple models and teams.",
      "chapters": [
        "data_engineering",
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "federated averaging",
      "definition": "The standard algorithm for federated learning where client model updates are aggregated using weighted averaging based on local dataset sizes to produce a global model.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "federated learning",
      "definition": "A machine learning approach that enables training models across decentralized data sources without centralizing the data, allowing multiple parties to collaboratively train a model while preserving data privacy.",
      "chapters": [
        "ml_systems",
        "frameworks",
        "workflow",
        "ondevice_learning",
        "privacy_security",
        "responsible_ai",
        "sustainable_ai",
        "ai_for_good",
        "frontiers",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "feedback loops",
      "definition": "Cyclical processes where outputs from later stages of the machine learning lifecycle inform and influence decisions in earlier stages, enabling continuous system improvement and adaptation.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "feedforward network",
      "definition": "A neural network architecture where information flows in one direction from input to output layers without cycles, forming the foundation for many deep learning models.",
      "chapters": [
        "dl_primer",
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "few-shot learning",
      "definition": "A machine learning paradigm that enables models to adapt to new tasks using only a small number of labeled examples, critical for data-sparse on-device scenarios.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "field-programmable gate array",
      "definition": "Reconfigurable hardware that can be programmed for specific tasks, offering flexibility between general-purpose processors and application-specific integrated circuits, useful for custom ML accelerations.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "field-programmable gate array (fpga)",
      "definition": "A reconfigurable integrated circuit that can be programmed after manufacturing to implement custom digital circuits and specialized computations.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "floating-point unit (fpu)",
      "definition": "A specialized processor component designed to perform arithmetic operations on floating-point numbers with high precision and efficiency.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "flops",
      "definition": "Floating Point Operations Per Second, a measure of computational complexity that counts the number of arithmetic operations required to execute a model, commonly used to compare model efficiency.",
      "chapters": [
        "dl_primer",
        "optimizations",
        "efficient_ai",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "forward pass",
      "definition": "The computation phase where input data flows through a neural network's layers to produce outputs, involving matrix multiplications and activation function applications.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "forward propagation",
      "definition": "The process of computing neural network predictions by passing input data through successive layers, applying weights, biases, and activation functions at each stage.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "foundation model",
      "definition": "Large-scale machine learning models trained on broad data that can be adapted to a wide range of downstream tasks, serving as a base for specialized applications.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "foundation models",
      "definition": "Large-scale, general-purpose AI models trained on broad data that can be adapted for many tasks, including models like GPT-3, BERT, and DALL-E with billions of parameters.",
      "chapters": [
        "efficient_ai",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fp16",
      "definition": "16-bit floating-point numerical representation that reduces memory usage and accelerates computation while maintaining acceptable precision for many machine learning applications.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fp16 computation",
      "definition": "The use of 16-bit floating-point arithmetic for neural network operations to reduce memory usage and increase computational speed on modern hardware accelerators.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fp32",
      "definition": "32-bit floating-point numerical representation that provides standard precision for mathematical computations but requires more memory and computational resources than lower-precision formats.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "fp32 to int8",
      "definition": "A common quantization transformation that converts 32-bit floating point weights and activations to 8-bit integers, achieving roughly 4x memory reduction while maintaining acceptable accuracy for many models.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "framework decomposition",
      "definition": "The systematic breakdown of neural network frameworks into hardware-mappable components, enabling efficient distribution of operations across processing elements.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gdpr",
      "definition": "The General Data Protection Regulation, a European Union law that imposes strict requirements on personal data processing and significantly influences privacy-preserving machine learning design.",
      "chapters": [
        "ondevice_learning",
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gemm",
      "definition": "General Matrix Multiply operations that follow the pattern C = αAB + βC, representing the fundamental computational kernel underlying most neural network operations including fully connected layers and convolutional layers.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gemv",
      "definition": "General Matrix-Vector multiplication operations that compute the product of a matrix and a vector, commonly used in neural network computations and requiring careful optimization for memory access patterns.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "generalization",
      "definition": "The ability of a machine learning model to perform well on unseen data that differs from the training set, often improved through diverse and high-quality training data.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "generative adversarial networks",
      "definition": "A class of machine learning systems where two neural networks compete against each other, with one generating fake data and the other trying to detect it, leading to highly realistic synthetic data generation.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "generative ai",
      "definition": "A category of artificial intelligence systems capable of creating new content such as text, images, audio, or video based on learned patterns from training data.",
      "chapters": [
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "glitches",
      "definition": "Momentary deviations in voltage, current, or signal that can cause incorrect operation in digital systems and circuits.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "governance frameworks",
      "definition": "Structured approaches for managing responsible AI development including policies, procedures, oversight mechanisms, and accountability structures.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gpt3",
      "definition": "OpenAI's 175-billion parameter language model released in 2020, costing an estimated $4.6 million to train and consuming approximately 1,287 MWh of electricity.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gpt4",
      "definition": "OpenAI's most advanced language model as of 2023, reportedly using a mixture-of-experts architecture with approximately 1.8 trillion parameters and training costs exceeding $100 million.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gpu",
      "definition": "Graphics Processing Unit, a specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images and parallel processing tasks like AI training.",
      "chapters": [
        "ml_systems",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "graceful degradation",
      "definition": "A system design principle where services continue functioning with reduced capabilities when faced with partial failures or data unavailability.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gradient accumulation",
      "definition": "A technique that simulates larger batch sizes by accumulating gradients from multiple smaller batches before updating model parameters, enabling training with limited memory.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gradient clipping",
      "definition": "A technique used during neural network training to prevent exploding gradients by limiting the magnitude of gradients to a specified threshold, helping maintain training stability in deep networks.",
      "chapters": [
        "frameworks",
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gradient compression",
      "definition": "A technique used in distributed training to reduce the communication overhead by compressing gradient information exchanged between computing nodes.",
      "chapters": [
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gradient descent",
      "definition": "An optimization algorithm that iteratively adjusts model parameters in the direction of the negative gradient of the loss function to minimize prediction errors and improve model performance.",
      "chapters": [
        "dl_primer",
        "frameworks",
        "training",
        "dnn_architectures",
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gradient synchronization",
      "definition": "The process in distributed training where locally computed gradients are aggregated across devices to ensure all devices update their parameters consistently.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gradient-based pruning",
      "definition": "A pruning method that uses gradient information during training to identify neurons or filters with smaller gradient magnitudes, which contribute less to reducing the loss function and can be safely removed.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "graphics processing unit",
      "definition": "Specialized parallel processors originally designed for graphics rendering but widely adopted for machine learning due to their ability to efficiently execute matrix operations and handle thousands of parallel computations.",
      "chapters": [
        "dl_primer",
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "graphics processing unit (gpu)",
      "definition": "A specialized processor originally designed for graphics rendering that provides massive parallel computing capabilities well-suited for neural network computations.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "green ai metrics",
      "definition": "Specialized performance indicators that measure the environmental impact of AI systems, including carbon footprint, energy efficiency, and resource utilization throughout the ML lifecycle.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "green computing",
      "definition": "The practice of designing, manufacturing, using, and disposing of computers and computer systems in an environmentally responsible manner.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "green500",
      "definition": "Ranking system that evaluates the world's most powerful supercomputers based on energy efficiency measured in FLOPS per watt rather than raw computational performance.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "grey-box attack",
      "definition": "An adversarial attack where the attacker has partial knowledge about the model, such as knowing the architecture but not the specific parameters or training data.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "groupwise quantization",
      "definition": "A quantization approach where parameters are divided into groups, with each group sharing quantization parameters, offering a balance between compression and accuracy by providing more granular control than layerwise methods.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "gru",
      "definition": "Gated Recurrent Unit, a simplified variant of LSTM that uses fewer gates while maintaining the ability to capture long-term dependencies in sequential data.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware abstraction",
      "definition": "The layer in ML frameworks that provides a unified interface to diverse computing hardware (CPUs, GPUs, TPUs, accelerators) while handling device-specific optimizations and memory management behind the scenes.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware acceleration",
      "definition": "The use of specialized computing hardware to perform certain operations faster and more efficiently than software running on general-purpose processors.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware accelerator",
      "definition": "Specialized computing hardware designed to efficiently execute specific types of computations, such as GPUs for parallel processing or TPUs for machine learning workloads.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware constraint optimization",
      "definition": "Techniques for adapting ML algorithms and models to work within the memory, compute, and power limitations of mobile and embedded devices.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware redundancy",
      "definition": "The duplication of critical hardware components to provide backup functionality and improve system reliability through voting mechanisms.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware trojan",
      "definition": "A malicious modification embedded in hardware components during manufacturing that can remain dormant under normal conditions but trigger harmful behavior when specific conditions are met.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware-aware design",
      "definition": "The practice of designing neural network architectures specifically optimized for target hardware platforms, considering factors like memory hierarchy, compute units, and data movement patterns to maximize efficiency.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hardware-software co-design",
      "definition": "Collaborative design methodology where hardware accelerators and software algorithms are jointly optimized to achieve maximum efficiency and performance.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hdfs (hadoop distributed file system)",
      "definition": "A distributed file system designed to store large datasets across clusters of commodity hardware, providing scalability and fault tolerance for big data applications.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "heartbeat mechanisms",
      "definition": "Periodic signals sent between system components to monitor health and detect failures, enabling timely fault detection and recovery.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hidden layer",
      "definition": "An intermediate layer in a neural network between input and output layers that learns abstract representations by transforming data through learned weights and activation functions.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hidden state",
      "definition": "The internal memory of recurrent neural networks that carries information from previous time steps, enabling the network to maintain context across sequential inputs.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hierarchical processing",
      "definition": "A multi-tier system architecture where data and intelligence flow between different levels of the computing stack, from sensors to edge devices to cloud systems.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hierarchical processing pattern",
      "definition": "A design pattern that organizes systems into tiers (edge, regional, cloud) that share responsibilities based on available resources and capabilities, optimizing resource usage across the computing spectrum.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "high bandwidth memory (hbm)",
      "definition": "An advanced memory technology that provides much higher bandwidth than traditional DRAM by using 3D stacking and wide interfaces, critical for data-intensive AI workloads.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "homomorphic encryption",
      "definition": "A cryptographic technique that allows computations to be performed directly on encrypted data without decrypting it first, enabling privacy-preserving machine learning inference.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "horizontal scaling",
      "definition": "Increasing system capacity by adding more machines or instances rather than upgrading existing hardware, providing better fault tolerance and load distribution.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hot spares",
      "definition": "Backup components kept ready to instantaneously replace failing components without disrupting system operation, providing redundancy.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "huber loss",
      "definition": "A robust loss function used in regression that is less sensitive to outliers compared to squared error loss, improving training stability.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "human oversight",
      "definition": "The principle that human judgment should supervise, correct, or halt automated decisions, maintaining meaningful human control over AI systems.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "human-ai collaboration",
      "definition": "The synergistic partnership between humans and AI systems where each contributes their unique strengths to solve complex problems more effectively than either could alone.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hybrid machine learning",
      "definition": "The integration of multiple ML paradigms such as cloud, edge, mobile, and tiny ML to form unified distributed systems that leverage complementary strengths.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hybrid parallelism",
      "definition": "A distributed training approach that combines data parallelism and model parallelism to leverage the benefits of both strategies for training very large models.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hyperparameter",
      "definition": "A configuration setting for machine learning algorithms that is set before training begins and controls aspects of the learning process, such as learning rate, batch size, or network architecture, distinct from model parameters learned during training.",
      "chapters": [
        "dl_primer",
        "frameworks",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hyperparameter optimization",
      "definition": "The process of finding the optimal configuration of hyperparameters (learning rate, batch size, network architecture parameters) that control the machine learning training process.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hyperparameters",
      "definition": "Configuration settings that control the learning process of machine learning algorithms but are not learned from data, such as learning rate, batch size, and network architecture parameters.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "hyperscale data center",
      "definition": "Large-scale data center facilities containing thousands of servers and covering extensive floor space, designed to efficiently support massive computing workloads.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "imagenet",
      "definition": "A massive visual database containing over 14 million labeled images across 20,000+ categories, created by Stanford's Fei-Fei Li starting in 2009, whose annual challenge became instrumental in driving breakthrough advances in computer vision.",
      "chapters": [
        "introduction",
        "efficient_ai",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "impact assessment frameworks",
      "definition": "Structured methodologies for evaluating the potential social, economic, and environmental effects of AI deployments in humanitarian and development contexts.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "imperative programming",
      "definition": "A programming paradigm where operations are executed immediately as they are encountered in the code, allowing for natural control flow and easier debugging but potentially limiting optimization opportunities.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "inference",
      "definition": "The phase of machine learning where a trained model makes predictions on new input data, typically requiring lower precision and computational resources than training.",
      "chapters": [
        "hw_acceleration",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "infrastructure as code",
      "definition": "Practice of managing and provisioning computing infrastructure through machine-readable configuration files rather than manual processes, enabling version control and automation.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "instruction set architecture (isa)",
      "definition": "The interface between software and hardware that defines the set of instructions a processor can execute, including data types and addressing modes.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "int8",
      "definition": "8-bit integer numerical representation used in quantized neural networks to reduce memory usage and accelerate inference while attempting to maintain model accuracy.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "int8 quantization",
      "definition": "A numerical precision reduction technique that represents model weights and activations using 8-bit integers instead of 32-bit floating point numbers, reducing memory usage and enabling faster inference on specialized hardware.",
      "chapters": [
        "optimizations",
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "intermittent faults",
      "definition": "Hardware faults that occur sporadically and unpredictably, appearing and disappearing without consistent patterns, making diagnosis challenging.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "internet of things",
      "definition": "A network of physical objects embedded with sensors, software, and other technologies that connect and exchange data with other devices and systems over the internet.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "interpretability",
      "definition": "The degree to which humans can understand the reasoning behind a machine learning model's predictions, often referring to inherently transparent models.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "iot sensors",
      "definition": "Internet of Things devices that collect and transmit environmental or behavioral data, often operating on limited power budgets and using low-bandwidth communication protocols.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "iterative pruning",
      "definition": "A gradual pruning strategy that removes parameters in multiple stages with fine-tuning between each stage, allowing the model to adapt to reduced capacity and typically achieving better accuracy than one-shot pruning.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "jax",
      "definition": "A numerical computing library developed by Google Research that combines NumPy's API with functional programming transformations including automatic differentiation, just-in-time compilation, and automatic vectorization for high-performance machine learning research.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "jit compilation",
      "definition": "Just-In-Time compilation that analyzes and optimizes code at runtime, enabling frameworks to balance the flexibility of eager execution with the performance benefits of graph optimization by compiling frequently used functions.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "k-anonymity",
      "definition": "A privacy technique that ensures each record in a dataset is indistinguishable from at least k-1 other records by generalizing quasi-identifiers.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "kernel",
      "definition": "A small matrix of learnable weights used in convolutional layers to detect specific features through the convolution operation, also called a filter.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "kernel fusion",
      "definition": "An optimization technique that combines multiple computational operations into a single kernel to reduce memory transfers and improve performance on parallel processors.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "key performance indicators",
      "definition": "Specific, measurable metrics used to evaluate the success and effectiveness of machine learning systems, such as accuracy, precision, recall, latency, and throughput.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "keyword spotting (kws)",
      "definition": "A technology that detects specific wake words or phrases in audio streams, typically used in voice-activated devices with constraints on power consumption and latency.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "knowledge distillation",
      "definition": "A model compression technique where a smaller \"student\" network learns to mimic the behavior of a larger \"teacher\" network by training on the teacher's soft output probabilities rather than just hard labels.",
      "chapters": [
        "optimizations",
        "efficient_ai",
        "ondevice_learning",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "l0-norm constraint",
      "definition": "A regularization technique that counts the number of non-zero parameters in a model, used in structured pruning to directly control model sparsity by penalizing the number of active weights.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "label shift",
      "definition": "A type of distribution shift where the distribution of target labels changes while the conditional relationship between features and labels remains constant.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lapack",
      "definition": "Linear Algebra Package that extends BLAS with higher-level linear algebra operations including matrix decompositions, eigenvalue problems, and linear system solutions, providing essential mathematical foundations for machine learning computations.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "large language models",
      "definition": "Neural networks with billions or trillions of parameters trained on vast text corpora, capable of understanding and generating human-like text across diverse domains and tasks.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "latency",
      "definition": "Time delay between receiving an input and producing an output, a critical performance metric for real-time applications that require immediate responses.",
      "chapters": [
        "ml_systems",
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "latency constraints",
      "definition": "Real-time requirements that limit the maximum acceptable delay for model inference, driving optimization decisions in deployment scenarios where response time is critical.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "layer normalization",
      "definition": "A normalization technique that normalizes inputs across the features dimension for each sample, commonly used in transformer architectures to stabilize training.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "layerwise quantization",
      "definition": "A quantization granularity where all parameters within a single layer share the same quantization parameters, providing computational efficiency but potentially limiting representational precision compared to finer-grained approaches.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "learning rate",
      "definition": "A hyperparameter that determines the step size at which a model's parameters are updated during training, controlling how quickly or slowly the model learns from the training data.",
      "chapters": [
        "dl_primer",
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "learning rate scheduling",
      "definition": "The systematic adjustment of learning rates during training, using strategies like step decay, exponential decay, or cosine annealing to improve convergence and final model performance.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lifecycle assessment",
      "definition": "A systematic approach to evaluating the environmental impacts of a product or system throughout its entire life cycle, from raw material extraction to disposal.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lifecycle coherence",
      "definition": "The principle that all stages of ML development should align with overall system objectives, maintaining consistency in data handling, model architecture, and evaluation criteria.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "linpack",
      "definition": "Benchmark developed at Argonne National Laboratory that measures system performance by solving dense systems of linear equations, famous for its use in Top500 supercomputer rankings.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "load balancing",
      "definition": "Techniques in mixture of experts models to ensure that computational load and training signal are distributed evenly across experts, preventing expert collapse and maintaining model efficiency.",
      "chapters": [
        "ops",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lookup table",
      "definition": "A data structure that replaces runtime computation with simpler array indexing operations, commonly used for performance optimization.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lora technology",
      "definition": "Long Range wireless communication protocol that enables IoT devices to communicate over 15+ kilometers with minimal power consumption, ideal for agricultural and environmental monitoring applications.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "loss function",
      "definition": "A mathematical function that quantifies the difference between neural network predictions and true labels, providing the optimization objective for training algorithms.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "loss scaling",
      "definition": "A technique used in mixed-precision training that multiplies the loss by a large factor before backpropagation to prevent gradient underflow in reduced precision formats.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lottery ticket hypothesis",
      "definition": "The theory that large neural networks contain sparse subnetworks that, when trained in isolation from proper initialization, can achieve comparable accuracy to the full network while being significantly smaller.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "low-rank adaptation",
      "definition": "A parameter-efficient fine-tuning method that approximates weight updates using low-rank matrices, reducing trainable parameters while maintaining adaptation capability.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "low-rank factorization",
      "definition": "A matrix decomposition technique that approximates large weight matrices as products of smaller matrices, reducing the number of parameters and computational operations required for neural network layers.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "lstm",
      "definition": "Long Short-Term Memory, a type of recurrent neural network architecture designed to handle long-term dependencies through gating mechanisms that control information flow.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine consciousness",
      "definition": "The hypothetical emergence of conscious awareness in artificial systems, representing a frontier research area exploring whether machines can develop subjective experiences.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning",
      "definition": "The methodological approach to implementing intelligent systems through computational techniques that automatically discover patterns in data, rather than through predetermined rules or explicit programming.",
      "chapters": [
        "introduction",
        "dl_primer",
        "ml_systems",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning accelerator (ml accelerator)",
      "definition": "Specialized computing hardware designed to efficiently execute machine learning workloads through optimized matrix operations, memory hierarchies, and parallel processing units.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning framework",
      "definition": "A software platform that provides tools and abstractions for designing, training, and deploying machine learning models, bridging user applications with infrastructure through computational graphs, hardware optimization, and workflow orchestration.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning frameworks",
      "definition": "Software libraries and platforms that provide tools, APIs, and abstractions for developing, training, and deploying machine learning models, such as TensorFlow and PyTorch.",
      "chapters": [
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning lifecycle",
      "definition": "A structured, iterative process that encompasses all stages involved in developing, deploying, and maintaining machine learning systems, from problem definition through ongoing monitoring and improvement.",
      "chapters": [
        "workflow",
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning operations",
      "definition": "The practice and set of tools focused on operationalizing machine learning models through automation, monitoring, and management of the entire ML pipeline from development to production.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning operations (mlops)",
      "definition": "The practice of deploying and maintaining machine learning models in production reliably and efficiently through automated pipelines.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning security",
      "definition": "The protection of data, models, and infrastructure from unauthorized access, manipulation, or disruption throughout the entire machine learning lifecycle.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine learning systems engineering",
      "definition": "The engineering discipline focused on building reliable, efficient, and scalable AI systems across computational platforms, spanning the entire AI lifecycle from data acquisition through deployment and operations with emphasis on resource-awareness and system-level optimization.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "machine unlearning",
      "definition": "Techniques for removing the influence of specific data points from trained models without complete retraining, supporting data deletion rights.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "macro benchmarks",
      "definition": "Evaluation methodology that assesses complete machine learning models to understand how architectural choices and component interactions affect overall system behavior and performance.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "magnitude-based pruning",
      "definition": "The most common pruning method that removes parameters with the smallest absolute values, based on the assumption that weights with smaller magnitudes contribute less to the model's output.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mapping optimization",
      "definition": "The process of assigning neural network operations to hardware resources in a way that minimizes communication overhead and maximizes utilization of available compute units.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "masking",
      "definition": "An anonymization technique that alters or obfuscates sensitive values so they cannot be directly traced back to the original data subject.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "megawatt-hour",
      "definition": "A unit of energy equal to one megawatt of power used for one hour, commonly used to measure electricity consumption in large facilities like data centers.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "membership inference attack",
      "definition": "An attack that attempts to determine whether a specific data point was included in a model's training dataset by analyzing the model's behavior and outputs.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "membership inference attacks",
      "definition": "Privacy attacks that attempt to determine whether a specific data point was included in a model's training set by analyzing model behavior.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "memory bandwidth",
      "definition": "Rate at which data can be read from or written to memory, measured in bytes per second, which often becomes a bottleneck in memory-intensive machine learning workloads.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "memory hierarchy",
      "definition": "The organization of memory systems with different access speeds and capacities, from fast on-chip caches to slower off-chip main memory.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "meta-learning",
      "definition": "The process of learning how to learn, where models are trained to quickly adapt to new tasks with minimal data, particularly useful for personalization in on-device systems.",
      "chapters": [
        "ondevice_learning",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "metadata",
      "definition": "Descriptive information about datasets that includes details about data collection, quality metrics, validation status, and other contextual information essential for data management.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "micro benchmarks",
      "definition": "Specialized evaluation tools that assess individual components or specific operations within machine learning systems, such as tensor operations or neural network layers.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "microcontroller",
      "definition": "A compact integrated circuit designed to govern specific operations in embedded systems, typically featuring limited processing power and memory but optimized for low power consumption and real-time applications.",
      "chapters": [
        "ml_systems",
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mini-batch gradient descent",
      "definition": "A training approach that computes gradients and updates weights using a small subset of training examples simultaneously, balancing computational efficiency with gradient estimation quality.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mini-batch processing",
      "definition": "An optimization approach that computes gradients over small batches of examples, balancing the computational efficiency of batch processing with the memory constraints of stochastic methods.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "minimax",
      "definition": "A decision-making strategy used in game theory that attempts to minimize the maximum possible loss in adversarial scenarios.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mixed precision training",
      "definition": "A technique that uses different numerical precisions for different parts of neural network training, typically combining 16-bit and 32-bit floating-point arithmetic to reduce memory usage and increase training speed.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mixed-precision computing",
      "definition": "A technique that uses different numerical precisions at various stages of computation, such as FP16 for matrix multiplications and FP32 for accumulations.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mixed-precision training",
      "definition": "A training technique that uses different numerical precisions for different operations, typically combining FP16 for forward and backward passes with FP32 for gradient updates to balance efficiency and numerical stability.",
      "chapters": [
        "training",
        "optimizations",
        "benchmarking",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mixture of experts",
      "definition": "An architectural approach that uses multiple specialized sub-models (experts) with a gating mechanism to route inputs to the most relevant experts, enabling efficient scaling while maintaining sparsity.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [
        "moe"
      ],
      "see_also": []
    },
    {
      "term": "ml lifecycle",
      "definition": "The iterative process that guides the development, evaluation, and continual improvement of machine learning systems, involving stages from data collection through model monitoring with feedback loops for continuous adaptation.",
      "chapters": [
        "introduction",
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "ml systems",
      "definition": "Integrated computing systems comprising three core components: data that guides algorithmic behavior, learning algorithms that extract patterns from data, and computing infrastructure that enables both training and inference processes.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "ml systems spectrum",
      "definition": "The range of machine learning system deployments from cloud-based systems with abundant resources to tiny embedded devices with severe constraints, each requiring different optimization strategies and trade-offs.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlcommons",
      "definition": "Organization that develops and maintains industry-standard benchmarks for machine learning systems, including the MLPerf suite for training and inference evaluation.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlops",
      "definition": "Engineering discipline that manages the end-to-end lifecycle of machine learning systems, combining ML development with operational practices for reliable production deployment.",
      "chapters": [
        "ops",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlperf",
      "definition": "Industry-standard benchmark suite that provides standardized tests for training and inference across various deep learning workloads, enabling fair comparisons of machine learning systems.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlperf inference",
      "definition": "Benchmark framework that evaluates machine learning inference performance across different deployment environments, from cloud data centers to mobile devices and embedded systems.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlperf mobile",
      "definition": "Specialized benchmark that extends MLPerf evaluation to smartphones and mobile devices, measuring latency and responsiveness under strict power and memory constraints.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlperf tiny",
      "definition": "Benchmark designed for embedded and ultra-low-power AI systems such as IoT devices, wearables, and microcontrollers operating with minimal processing capabilities.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mlperf training",
      "definition": "Standardized benchmark that evaluates machine learning training performance by measuring time-to-accuracy, throughput, and resource utilization across different hardware platforms.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mnist",
      "definition": "Modified National Institute of Standards and Technology database of handwritten digits containing 70,000 28×28 pixel images, serving as the \"Hello World\" of computer vision.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mobile machine learning",
      "definition": "The execution of machine learning models directly on portable, battery-powered devices like smartphones and tablets, enabling personalized and responsive applications.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mobile ml",
      "definition": "Machine learning systems optimized for mobile devices like smartphones and tablets, balancing computational efficiency with inference accuracy for on-device processing.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mobile-optimized architectures",
      "definition": "Neural network designs specifically created for mobile deployment, emphasizing parameter efficiency, computational speed, and energy conservation.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mobilenet",
      "definition": "Efficient neural network architecture using depthwise separable convolutions, achieving approximately 50× fewer parameters than traditional models while enabling smartphone deployment.",
      "chapters": [
        "efficient_ai",
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mode collapse",
      "definition": "A failure mode in generative models where the model produces only a limited variety of outputs, ignoring the diversity present in the training data and failing to capture the full distribution.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model cards",
      "definition": "Documentation framework that provides structured information about machine learning models, including intended use, performance characteristics, and limitations.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model compression",
      "definition": "Techniques to reduce the size and computational requirements of machine learning models through methods like quantization, pruning, and knowledge distillation to enable deployment on resource-constrained devices.",
      "chapters": [
        "ml_systems",
        "optimizations",
        "ops",
        "ondevice_learning",
        "sustainable_ai",
        "ai_for_good",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model deployment",
      "definition": "The process of integrating trained machine learning models into production systems where they can make predictions on new data and provide value to end users.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model drift",
      "definition": "The degradation of machine learning model performance over time due to changes in data patterns, user behavior, or environmental conditions that differ from the original training conditions.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model evaluation",
      "definition": "The systematic assessment of machine learning model performance using various metrics and validation techniques to determine whether the model meets requirements and is ready for deployment.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model extraction",
      "definition": "The process of stealing or recreating a machine learning model by observing its input-output behavior, often through systematic querying of model APIs.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model inversion attack",
      "definition": "An attack that attempts to reconstruct training data or infer sensitive information about the dataset by analyzing a model's outputs and confidence scores.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model optimization",
      "definition": "The systematic refinement of machine learning models to enhance their efficiency while maintaining effectiveness, balancing trade-offs between accuracy, computational cost, memory usage, latency, and energy efficiency.",
      "chapters": [
        "optimizations",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model parallelism",
      "definition": "A distributed computing strategy that partitions a neural network model across multiple devices, enabling training of large models that exceed the memory capacity of individual devices by distributing layers or components across hardware.",
      "chapters": [
        "frameworks",
        "training",
        "efficient_ai",
        "benchmarking",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model pruning",
      "definition": "The process of removing unnecessary weights, neurons, or connections from a trained neural network to reduce its size and computational requirements.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model quantization",
      "definition": "A technique that reduces the precision of model parameters (typically from 32-bit to 8-bit or lower) to decrease model size and computational requirements while maintaining acceptable accuracy.",
      "chapters": [
        "ml_systems",
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model registry",
      "definition": "Centralized repository for storing, versioning, and managing trained machine learning models with associated metadata, facilitating model governance and deployment.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model serving",
      "definition": "Infrastructure and systems that expose deployed machine learning models through APIs to handle prediction requests at scale with appropriate latency and throughput.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model training",
      "definition": "The process of using machine learning algorithms to learn patterns from training data, adjusting model parameters to minimize prediction errors and create a functional predictive system.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model uncertainty",
      "definition": "The inadequacy of a machine learning model to capture the full complexity of the underlying data-generating process, leading to prediction uncertainty.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model validation",
      "definition": "The process of testing machine learning models on independent datasets to assess their generalization ability and ensure they perform reliably on unseen data.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model versioning",
      "definition": "The systematic tracking and management of different versions of machine learning models, including their parameters, training data, and performance metrics, to enable comparison and rollback capabilities.",
      "chapters": [
        "ops",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "model watermarking",
      "definition": "A technique for embedding verifiable ownership signatures into machine learning models that can be used to detect unauthorized use or prove intellectual property theft.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "momentum",
      "definition": "An optimization technique that accumulates a velocity vector across iterations to help gradient descent navigate through local minima and accelerate convergence in consistent gradient directions.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "monitoring",
      "definition": "The continuous observation and measurement of machine learning system performance, data quality, and operational metrics in production to detect issues and trigger maintenance actions.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "monte carlo dropout",
      "definition": "A technique that uses multiple forward passes with different dropout masks at inference time to estimate prediction uncertainty.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "moore's law",
      "definition": "The observation that the number of transistors on a microchip doubles approximately every two years while the cost of computers is halved.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "moores law",
      "definition": "Intel co-founder Gordon Moore's 1965 observation that transistor density doubles every 2 years, with hardware improvements following this trend while AI algorithmic efficiency improved 44× in 7 years.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multi-agent approach",
      "definition": "Systems architecture where multiple AI agents collaborate, negotiate, or compete to solve complex problems, enabling division of labor and specialized expertise across different components.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multi-head attention",
      "definition": "An attention mechanism that uses multiple parallel attention heads, each focusing on different aspects of the input to capture diverse types of relationships simultaneously.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multi-layer perceptron",
      "definition": "A feedforward neural network with one or more hidden layers between input and output, capable of learning non-linear mappings through dense connections and activation functions.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multicalibration",
      "definition": "A fairness technique ensuring that model predictions remain calibrated across intersecting subgroups, addressing complex demographic interactions.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multilayer perceptron",
      "definition": "A feedforward neural network with one or more hidden layers between input and output layers, capable of learning nonlinear relationships in data.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "multimodal ai",
      "definition": "AI systems that can process and understand multiple types of data simultaneously, such as text, images, audio, and video, enabling more comprehensive understanding and interaction.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "mycin",
      "definition": "One of the first large-scale expert systems developed at Stanford in 1976 to diagnose blood infections, representing the shift toward capturing human expert knowledge in specific domains rather than pursuing general artificial intelligence.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "narrow ai",
      "definition": "AI systems designed to excel at specific, well-defined tasks but lacking the ability to generalize across diverse problem domains, in contrast to artificial general intelligence.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "nas-generated architecture",
      "definition": "Neural network architectures discovered through automated Neural Architecture Search rather than manual design, often achieving better efficiency-accuracy trade-offs through exhaustive exploration of design spaces.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "network structure modification",
      "definition": "Architectural changes to neural networks that improve efficiency, including techniques like depthwise separable convolutions, bottleneck layers, and efficient attention mechanisms that reduce computational complexity.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neural architecture search",
      "definition": "An automated approach that uses machine learning algorithms to discover optimal neural network architectures by searching through possible combinations of layers, connections, and hyperparameters for specific constraints.",
      "chapters": [
        "optimizations",
        "efficient_ai",
        "sustainable_ai",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neural engine",
      "definition": "Specialized hardware accelerators designed for machine learning inference and training, such as Apple's Neural Engine or Google's Edge TPU, optimized for on-device AI workloads.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neural network",
      "definition": "A computational model inspired by biological neural networks, consisting of interconnected nodes (neurons) that process information through weighted connections and activation functions.",
      "chapters": [
        "dl_primer",
        "dnn_architectures",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neural processing unit (npu)",
      "definition": "Specialized processors designed specifically for accelerating neural network operations and machine learning computations, optimized for parallel processing of AI workloads.",
      "chapters": [
        "ml_systems",
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "neuromorphic computing",
      "definition": "Computing architectures inspired by the structure and function of biological neural networks, designed to process information more efficiently than traditional digital computers.",
      "chapters": [
        "frontiers",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "non-iid data",
      "definition": "Non-independent and identically distributed data where samples are not uniformly distributed across devices or time, creating challenges for federated learning convergence and generalization.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "nosql",
      "definition": "A category of database systems designed to handle large volumes of unstructured or semi-structured data with flexible schemas, often used in big data applications.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "numerical precision optimization",
      "definition": "The dimension of model optimization that addresses how numerical values are represented and processed, including quantization techniques that map high-precision values to lower-bit representations.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "observability",
      "definition": "Comprehensive monitoring approach that provides insight into system behavior through metrics, logs, and traces, enabling understanding of internal states from external outputs.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "olap (online analytical processing)",
      "definition": "A database approach optimized for complex analytical queries across large datasets, typically used in data warehouses for business intelligence.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "oltp (online transaction processing)",
      "definition": "A database approach optimized for frequent, short transactions and real-time processing, commonly used in operational applications.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "on-chip memory",
      "definition": "Fast memory integrated directly onto the processor chip, including caches and scratchpad memory, providing high bandwidth and low latency data access.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "on-device learning",
      "definition": "The local adaptation or training of machine learning models directly on deployed hardware devices without reliance on continuous connectivity to centralized servers.",
      "chapters": [
        "ondevice_learning",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "one-shot pruning",
      "definition": "A pruning strategy where a large fraction of parameters is removed in a single step, typically followed by fine-tuning to recover accuracy, offering simplicity but potentially requiring more aggressive fine-tuning.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "online inference",
      "definition": "Real-time prediction serving that processes individual requests with low latency, suitable for interactive applications requiring immediate responses.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "onnx",
      "definition": "Open Neural Network Exchange, a standardized format for representing machine learning models that enables interoperability between different frameworks, allowing models trained in one framework to be deployed using another.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "onnx runtime",
      "definition": "Cross-platform inference engine that optimizes machine learning models through techniques like operator fusion and kernel tuning to improve inference speed and reduce computational overhead.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "optimizer",
      "definition": "An algorithm that adjusts model parameters during training to minimize the loss function, with common examples including SGD (Stochastic Gradient Descent), Adam, and RMSprop, each with different strategies for parameter updates.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "orchestration",
      "definition": "The coordination and management of multiple AI systems or agents working together, ensuring proper sequencing, communication, and resource allocation across distributed intelligence systems.",
      "chapters": [
        "ops",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "outlier detection",
      "definition": "The process of identifying data points that significantly deviate from normal patterns, which may represent errors, anomalies, or valuable rare events.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "overfitting",
      "definition": "A phenomenon where a model learns specific details of training data so well that it fails to generalize to new, unseen examples, typically indicated by high training accuracy but poor validation performance.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "oxide breakdown",
      "definition": "The failure of an oxide layer in transistors due to excessive electric field stress, causing permanent hardware faults.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "padding",
      "definition": "A technique in convolutional networks that adds zeros or other values around the input borders to control the spatial dimensions of the output feature maps.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "paradigm shift",
      "definition": "A fundamental change in scientific approach, like the shift from symbolic reasoning to statistical learning in AI during the 1990s, and from shallow to deep learning in the 2010s, requiring researchers to abandon established methods for radically different approaches.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "parallelism",
      "definition": "The simultaneous execution of multiple computational tasks or operations, fundamental to achieving high performance in neural network processing.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "parameter",
      "definition": "A learnable variable in a machine learning model, such as weights and biases in neural networks, that are adjusted during training to optimize performance.",
      "chapters": [
        "dl_primer",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "parameter efficient finetuning",
      "definition": "Methods like LoRA and Adapters that update less than 1% of model parameters while achieving full fine-tuning performance, reducing memory requirements from gigabytes to megabytes.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "partitioning",
      "definition": "A database technique that divides large datasets into smaller, manageable segments based on specific criteria to improve query performance and system scalability.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "perceptron",
      "definition": "One of the first computational learning algorithms developed by Frank Rosenblatt in 1957, a system that could learn to classify patterns by making yes/no decisions based on inputs, paving the way for modern neural networks.",
      "chapters": [
        "introduction",
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "performance insights",
      "definition": "Analytical observations derived from monitoring production machine learning systems that reveal opportunities for improvement in model accuracy, system efficiency, or user experience.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "performance-efficiency scaling",
      "definition": "Mathematical relationships describing how computational efficiency improvements translate to performance gains across different model architectures and training regimes.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "permanent faults",
      "definition": "Hardware defects that persist irreversibly until repair or component replacement, consistently affecting system behavior.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "perplexity",
      "definition": "Measurement of how well a language model predicts text, calculated as 2^(cross-entropy loss), with lower values indicating better prediction capability.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "personalization layers",
      "definition": "Model components, typically the final classification layers, that are adapted locally to user-specific data while keeping shared backbone layers frozen.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "physical attack",
      "definition": "Direct manipulation or tampering with computing hardware to compromise the security and integrity of machine learning systems, bypassing traditional software defenses.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "pipeline jungle",
      "definition": "Anti-pattern where complex, interdependent data processing pipelines become difficult to maintain, debug, and modify, leading to technical debt and operational complexity.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "pipeline parallelism",
      "definition": "A model parallelism technique that distributes consecutive layers of a neural network across different devices, enabling parallel processing where each device works on different stages of the computation pipeline.",
      "chapters": [
        "frameworks",
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "pooling",
      "definition": "A downsampling operation in convolutional networks that reduces spatial dimensions while retaining important features, commonly using max or average operations over local regions.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "positional encoding",
      "definition": "A method used in transformer architectures to inject information about the position of tokens in a sequence, since transformers lack inherent sequential processing.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "post-hoc explanations",
      "definition": "Explanation methods applied after model training that treat the model as a black box and infer reasoning patterns from input-output behavior.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "post-training quantization",
      "definition": "A quantization approach applied to already-trained models without modifying the training process, typically involving calibration on representative data to determine optimal quantization parameters.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "power usage effectiveness",
      "definition": "A metric used to determine the energy efficiency of a data center, calculated as the ratio of total facility energy consumption to IT equipment energy consumption.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "power usage effectiveness (pue)",
      "definition": "Metric used in data centers to measure energy efficiency, calculated as the ratio of total facility power consumption to IT equipment power consumption.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "precision",
      "definition": "In numerical computing, the number of bits used to represent numbers, affecting both computational accuracy and resource requirements in machine learning systems.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "precision agriculture",
      "definition": "The use of technology including GPS, sensors, and machine learning to optimize farming practices by precisely monitoring and managing crop inputs like water, fertilizer, and pesticides.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "prefetching",
      "definition": "A system optimization technique that loads data into memory before it is needed, overlapping data loading with computation to reduce idle time and improve training throughput.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "principal component analysis",
      "definition": "Dimensionality reduction technique that identifies the most important directions of variation in data, reducing computational complexity while preserving 90%+ of data variance.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "principle of least privilege",
      "definition": "A security concept where users are given the minimum access levels necessary to complete their job functions, reducing security risks.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "privacy budget",
      "definition": "A concept in differential privacy that represents the total amount of privacy loss allowed across all queries or computations, with each operation consuming part of this finite budget.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "privacy-preserving machine learning",
      "definition": "Techniques and approaches that enable machine learning while protecting the privacy of individuals whose data is used for training or inference.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "privacy-preserving techniques",
      "definition": "Methods designed to protect individual privacy in machine learning, including differential privacy, federated learning, and local processing.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "privacy-utility tradeoff",
      "definition": "The fundamental tension between preserving individual privacy and maintaining the utility of data for machine learning, requiring careful balance through techniques like differential privacy.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "problem definition",
      "definition": "The initial stage of machine learning development that involves clearly specifying objectives, constraints, success metrics, and operational requirements to guide all subsequent development decisions.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "programmatic logic controllers",
      "definition": "Industrial control systems used in manufacturing and IoT environments that can be integrated with ML models for automated decision-making in operational technology contexts.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "progressive enhancement pattern",
      "definition": "A design pattern that establishes baseline functionality under minimal resource conditions and incrementally incorporates advanced features as additional resources become available.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "prompt engineering",
      "definition": "The practice of designing and optimizing text prompts to effectively communicate with large language models and achieve desired outputs from AI systems.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "protein folding problem",
      "definition": "The scientific challenge of predicting the three-dimensional structure of proteins from their amino acid sequences, a problem that puzzled scientists for decades until systems like AlphaFold achieved breakthrough accuracy using deep learning approaches.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "pruning",
      "definition": "A model compression technique that removes unnecessary connections or neurons from neural networks to reduce model size and computational requirements without significantly impacting performance.",
      "chapters": [
        "efficient_ai",
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "pseudonymization",
      "definition": "A privacy technique that replaces direct identifiers with artificial identifiers while maintaining the ability to trace records for analysis purposes.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "pytorch",
      "definition": "A deep learning framework developed by Facebook's AI Research lab that emphasizes dynamic computational graphs, eager execution, and intuitive Python integration, particularly popular for research and experimentation.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "quantization",
      "definition": "A model compression technique that reduces the precision of model parameters and activations from higher precision formats (like 32-bit floats) to lower precision (like 8-bit integers), significantly reducing memory usage and computational requirements.",
      "chapters": [
        "frameworks",
        "efficient_ai",
        "hw_acceleration",
        "ondevice_learning",
        "sustainable_ai",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "quantization granularity",
      "definition": "The level at which quantization parameters are applied, ranging from per-tensor (coarsest) to per-channel or per-group (finer), with finer granularity typically preserving more accuracy but requiring more storage.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "quantization-aware training",
      "definition": "A training approach where quantization effects are simulated during the training process, allowing the model to adapt to reduced precision and typically achieving better accuracy than post-training quantization.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "quantum machine learning",
      "definition": "The intersection of quantum computing and machine learning, exploring how quantum algorithms and quantum computers can enhance or transform machine learning tasks.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "queries per second (qps)",
      "definition": "Performance metric that measures how many inference requests a system can process in one second, commonly used to evaluate throughput in production deployments.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "query key value",
      "definition": "The three components of attention mechanisms where queries determine what to look for, keys represent what is available, and values contain the actual information to be weighted and combined.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "real-time processing",
      "definition": "The processing of data as it becomes available, with guaranteed response times that meet strict timing constraints for immediate decision-making.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "receptive field",
      "definition": "The region of the input that influences a particular neuron's output, determining the spatial extent of patterns that can be detected by that neuron.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "rectified linear unit",
      "definition": "An activation function that outputs the input if positive and zero otherwise, widely used in modern neural networks for its computational simplicity and ability to avoid vanishing gradients.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "recurrent neural network",
      "definition": "A type of neural network designed for sequential data processing, featuring connections that create loops allowing information to persist across time steps.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "regularization",
      "definition": "Techniques used to prevent overfitting in neural networks by adding constraints or penalties, including methods like dropout, weight decay, and data augmentation.",
      "chapters": [
        "dnn_architectures",
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "relu",
      "definition": "Rectified Linear Unit activation function defined as f(x) = max(0,x) that introduces nonlinearity while maintaining computational efficiency and avoiding vanishing gradient problems.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "renewable energy",
      "definition": "Energy collected from renewable resources that are naturally replenished, including solar, wind, hydroelectric, geothermal, and biomass sources.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "residual connection",
      "definition": "A skip connection that adds the input of a layer to its output, enabling the training of very deep networks by mitigating the vanishing gradient problem.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "resnet",
      "definition": "Residual Network, a deep convolutional architecture that introduced skip connections, enabling the training of networks with hundreds of layers and achieving breakthrough performance.",
      "chapters": [
        "efficient_ai",
        "dnn_architectures",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "resource paradox",
      "definition": "The challenge in social impact applications where areas with the greatest needs often lack the basic infrastructure required for traditional technology deployments, requiring innovative engineering solutions.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "resource-constrained environments",
      "definition": "Deployment contexts with limited computational power, network bandwidth, or power availability, typically requiring specialized system design and optimization techniques.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "responsible ai",
      "definition": "The practice of developing and deploying AI systems in ways that are ethical, fair, transparent, and beneficial to society while minimizing potential harms and biases.",
      "chapters": [
        "responsible_ai",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "retinal fundus photographs",
      "definition": "Medical images of the interior surface of the eye, including the retina, optic disc, and blood vessels, commonly used for diagnosing eye diseases and training medical AI systems.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "reverse-mode differentiation",
      "definition": "An automatic differentiation technique that computes gradients by traversing the computational graph in reverse order, highly efficient for functions with many inputs and few outputs, making it ideal for neural network training.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "reward hacking",
      "definition": "The phenomenon where AI systems exploit unintended aspects of reward functions to maximize scores while violating the intended objectives.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "rlhf",
      "definition": "Reinforcement Learning from Human Feedback - a training method that uses human preferences to guide model behavior, enabling AI systems to better align with human values and intentions.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [
        "reinforcement learning from human feedback"
      ],
      "see_also": []
    },
    {
      "term": "rmsprop",
      "definition": "An adaptive learning rate optimization algorithm that maintains a moving average of squared gradients to automatically adjust learning rates for each parameter during training.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "robust ai",
      "definition": "The ability of artificial intelligence systems to maintain performance and reliability despite internal errors, external perturbations, and environmental changes.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "robustness",
      "definition": "A model's ability to maintain stable and consistent performance under input variations, environmental changes, or adversarial conditions.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "robustness metrics",
      "definition": "Quantitative measures for evaluating model stability under various perturbations, including adversarial accuracy, certified robustness bounds, and performance under distribution shift.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "rollback",
      "definition": "Process of reverting to a previous stable version of a model or system when issues are detected in production, ensuring service continuity.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "scalability",
      "definition": "The ability of machine learning systems to handle increasing amounts of data, users, or computational demands without significant degradation in performance or user experience.",
      "chapters": [
        "benchmarking",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "scaling laws",
      "definition": "Empirical relationships that quantify the correlation between model performance and training resources, following predictable power-law relationships with model size, dataset size, and compute budget.",
      "chapters": [
        "efficient_ai",
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "scan chains",
      "definition": "Dedicated test paths in processors that provide access to internal registers and logic for comprehensive hardware testing and fault detection.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "schema",
      "definition": "The structure and format definition of data that specifies data types, field names, and relationships, essential for data validation and processing consistency.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "schema evolution",
      "definition": "The process of modifying data schemas over time while maintaining backward compatibility and ensuring continued functionality of dependent systems and applications.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "schema-on-read",
      "definition": "An approach used in data lakes where data structure is defined and enforced at the time of reading rather than when storing, providing flexibility for diverse data types.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "scope 1 emissions",
      "definition": "Direct greenhouse gas emissions from sources owned or controlled by an organization, such as on-site fuel combustion and company vehicles.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "scope 2 emissions",
      "definition": "Indirect greenhouse gas emissions from the generation of purchased electricity, steam, heating, or cooling consumed by an organization.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "scope 3 emissions",
      "definition": "All other indirect greenhouse gas emissions that occur in an organization's value chain, including manufacturing, transportation, and end-of-life disposal.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "secure aggregation",
      "definition": "A cryptographic protocol that enables federated learning servers to compute aggregate model updates without accessing individual client contributions, enhancing privacy protection.",
      "chapters": [
        "ondevice_learning",
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "secure computation",
      "definition": "Cryptographic protocols that enable multiple parties to jointly compute functions over private inputs without revealing those inputs to each other.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "secure multi-party computation",
      "definition": "A cryptographic method that allows multiple parties to jointly compute a function over their private inputs without revealing those inputs to each other.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "segmentation maps",
      "definition": "Detailed annotations that classify objects at the pixel level, providing the most granular labeling information but requiring significantly more storage and processing resources.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "selective computation",
      "definition": "Computational strategies that dynamically allocate processing resources based on input complexity or current needs, improving efficiency by avoiding unnecessary computation.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "self supervised learning",
      "definition": "Training method where models create their own labels from input data structure, enabling learning from billions of unlabeled examples and revolutionizing NLP and computer vision.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "self-attention",
      "definition": "An attention mechanism where queries, keys, and values all come from the same sequence, allowing each position to attend to all positions including itself.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "self-refinement",
      "definition": "A training approach where models iteratively improve their own outputs by critiquing and refining their initial responses, enabling continuous improvement and better alignment with desired behaviors.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "self-supervised learning",
      "definition": "A machine learning paradigm where models learn representations from unlabeled data by predicting parts of the input from other parts, reducing dependence on manually labeled datasets.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "semi-supervised learning",
      "definition": "A machine learning approach that uses both labeled and unlabeled data for training, leveraging structural assumptions to improve model performance with limited labels.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sequential neural networks",
      "definition": "Neural network architectures designed to process data that occurs in sequences over time, maintaining a form of memory of previous inputs to inform current decisions, essential for tasks like predicting pedestrian movement patterns.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "serverless",
      "definition": "Cloud computing model where infrastructure is automatically managed by the provider, allowing code execution without server management concerns.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "service level agreement (sla)",
      "definition": "Formal contract specifying minimum performance standards and uptime guarantees for production services, with penalties for non-compliance.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "service level objective (slo)",
      "definition": "Internal targets for service reliability and performance metrics such as latency, error rates, and availability that guide operational decisions.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "shadow deployment",
      "definition": "Testing strategy where new model versions process live traffic in parallel with production models without affecting user-facing results, enabling safe validation.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "shallow learning",
      "definition": "Machine learning approaches that use algorithms with limited complexity, such as support vector machines and decision trees, which require carefully engineered features but cannot automatically discover hierarchical representations like deep learning methods.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "side-channel attack",
      "definition": "An attack that exploits information leaked through the physical implementation of computing systems, such as power consumption, electromagnetic emissions, or timing variations.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sigmoid",
      "definition": "An activation function that maps inputs to the range (0,1) through an S-shaped curve, commonly used in output layers for binary classification but prone to vanishing gradient problems.",
      "chapters": [
        "dl_primer",
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "silent data corruption (sdc)",
      "definition": "Undetected errors during computation or data transfer that propagate through system layers without triggering alerts, potentially compromising results.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "simd (single instruction, multiple data)",
      "definition": "A parallel computing architecture that applies the same operation to multiple data elements simultaneously, effective for regular data-parallel computations.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "simt (single instruction, multiple thread)",
      "definition": "An extension of SIMD that enables parallel execution across multiple independent threads, each maintaining its own state and program counter.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "single-instance throughput",
      "definition": "Performance measurement focusing on the rate at which a single model instance can process requests, contrasting with batch throughput metrics.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "singular value decomposition",
      "definition": "A matrix factorization technique that decomposes a matrix into the product of three matrices, commonly used in low-rank approximations to compress neural network layers by retaining only the most significant singular values.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "skip connection",
      "definition": "A direct connection that bypasses one or more layers, allowing gradients to flow more easily through deep networks and enabling better training of very deep architectures.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "smallholder farmers",
      "definition": "Farmers operating on plots smaller than 2 hectares who produce a significant portion of global food supply but often lack access to modern agricultural technology and credit.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "social impact measurement",
      "definition": "Systematic evaluation of how AI applications affect communities and individuals, including metrics for accessibility, equity, effectiveness, and unintended consequences.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "softmax",
      "definition": "An activation function that converts a vector of real numbers into a probability distribution, commonly used in the output layer for multi-class classification tasks.",
      "chapters": [
        "training",
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "software fault",
      "definition": "Unintended behavior in software systems resulting from defects, bugs, or design oversights that can impair performance or compromise security.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sparse training",
      "definition": "A training approach that maintains sparsity in neural network weights throughout the training process, reducing computational requirements and memory usage.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sparse updates",
      "definition": "A training strategy that selectively updates only a subset of model parameters based on their importance or contribution to performance, reducing computational and memory overhead.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sparsity",
      "definition": "The property of neural networks where many weights are zero or near-zero, which can be exploited for computational efficiency through specialized hardware support and algorithms designed for sparse operations.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "spec cpu",
      "definition": "Standardized benchmark suite developed by the System Performance Evaluation Cooperative that measures processor performance using real-world applications rather than synthetic tests.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "spec power",
      "definition": "Benchmark methodology that measures server energy efficiency across varying workload levels, enabling direct comparisons of power-performance trade-offs in computing systems.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "specification gaming",
      "definition": "When AI systems find unexpected ways to achieve high rewards that technically satisfy the objective function but violate the intended purpose.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "speculative execution",
      "definition": "A performance optimization in processors that executes instructions before confirming they are needed, which can inadvertently expose sensitive data through microarchitectural side channels.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "squeezenet",
      "definition": "Compact CNN architecture achieving AlexNet-level accuracy with 50× fewer parameters, demonstrating that clever architecture design can dramatically reduce model size without sacrificing performance.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stage-specific metrics",
      "definition": "Performance indicators tailored to individual lifecycle phases, such as data quality metrics during preparation, training convergence during modeling, and latency metrics during deployment.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "state space models",
      "definition": "Neural architectures that process sequences by maintaining compressed memory representations that update incrementally, offering linear scaling advantages over transformer attention mechanisms.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "static graph",
      "definition": "A computational graph that is defined completely before execution begins, enabling comprehensive optimization and efficient deployment but requiring all operations to be specified upfront, limiting runtime flexibility.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "static graphs vs dynamic graphs",
      "definition": "Two fundamental approaches to representing computations in ML frameworks: static graphs are defined before execution and enable optimization but limit flexibility, while dynamic graphs are built during execution allowing for flexible control flow but with potential optimization limitations.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "static quantization",
      "definition": "A quantization approach where quantization parameters are determined once during calibration and remain fixed during inference, providing computational efficiency but less adaptability than dynamic approaches.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "statistical learning",
      "definition": "The era of machine learning that emerged in the 1990s, shifting focus from rule-based symbolic AI to algorithms that could learn patterns from data, laying the groundwork for modern data-driven approaches to artificial intelligence.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stochastic computing",
      "definition": "Computing techniques that use random bits and probabilistic operations to perform arithmetic, potentially offering better fault tolerance than traditional methods.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stochastic gradient descent",
      "definition": "A variant of gradient descent that estimates gradients using individual training examples or small batches rather than the entire dataset, reducing memory requirements and enabling online learning.",
      "chapters": [
        "training",
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stream ingestion",
      "definition": "A data processing pattern that handles data in real-time as it arrives, essential for applications requiring immediate processing and low-latency responses.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stream processing",
      "definition": "Real-time data processing approach that handles continuous flows of data as it arrives, enabling immediate responses to events and pattern detection.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stride",
      "definition": "The step size by which a convolutional filter moves across the input, controlling the spatial dimensions of the output and the degree of overlap between filter applications.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "structured pruning",
      "definition": "A pruning approach that removes entire computational units such as neurons, channels, or layers, producing smaller dense models that are more hardware-friendly than the sparse matrices created by unstructured pruning.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "stuck-at fault",
      "definition": "A permanent hardware fault where a signal line becomes fixed at a logical 0 or 1 regardless of input, causing incorrect computations.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "student system",
      "definition": "One of the first AI programs from 1964 by Daniel Bobrow that demonstrated natural language understanding by converting English algebra word problems into mathematical equations, marking an important milestone in symbolic AI.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "student-teacher learning",
      "definition": "The core mechanism of knowledge distillation where a smaller student network learns from a larger teacher network, typically using soft targets that provide more information than hard classification labels.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "supervised learning",
      "definition": "A machine learning approach where models learn from labeled training examples to make predictions on new, unlabeled data.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "supply chain attack",
      "definition": "An attack that compromises hardware or software components during the manufacturing, distribution, or integration process, potentially affecting multiple downstream systems.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "support vector machines",
      "definition": "Machine learning algorithm using the \"kernel trick\" to find optimal decision boundaries, dominating competitions before deep learning until neural networks gained prominence around 2010.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sustainable ai",
      "definition": "The practice of developing and deploying artificial intelligence systems that minimize environmental impact while maintaining effectiveness and accessibility.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "sustainable development goals",
      "definition": "A collection of 17 global goals adopted by the United Nations to address pressing social, economic, and environmental challenges by 2030, providing a framework for AI applications in social good.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "swarm intelligence",
      "definition": "Collective intelligence emerging from decentralized, self-organized systems, often inspired by biological swarms and applied to distributed ML systems and robotics.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "symbolic ai",
      "definition": "The early approach to artificial intelligence that attempted to implement intelligence through symbol manipulation and rule-based systems, exemplified by programs like STUDENT that could only handle inputs matching their pre-programmed patterns.",
      "chapters": [
        "introduction",
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "symbolic programming",
      "definition": "A programming paradigm where computations are represented as abstract symbols and expressions that are constructed first and executed later, allowing for comprehensive optimization but requiring explicit execution phases.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "synthetic benchmark",
      "definition": "Artificial test program designed to measure specific aspects of system performance, as opposed to benchmarks based on real-world applications and workloads.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "synthetic data",
      "definition": "Artificially generated data created using algorithms, simulations, or generative models to supplement real-world datasets, addressing limitations in data availability or privacy concerns.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "synthetic data generation",
      "definition": "The creation of artificial datasets that approximate the statistical properties of real data while reducing privacy risks and avoiding direct exposure of sensitive information.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "system efficiency",
      "definition": "Optimization of machine learning systems across algorithmic, compute, and data efficiency dimensions to minimize computational, memory, and energy demands while maintaining performance.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "system on chip",
      "definition": "An integrated circuit that incorporates most or all components of a computer or electronic system, including CPU, GPU, memory, and specialized processors on a single chip.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "system-on-chip (soc)",
      "definition": "Integrated circuit that contains most or all components of a computer system, commonly used in mobile devices and embedded systems for space and power efficiency.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "system-wide sustainability",
      "definition": "Holistic approach to environmental responsibility that considers the entire AI infrastructure ecosystem, from data centers to edge devices, rather than optimizing individual components in isolation.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "systems integration",
      "definition": "The process of combining various components and subsystems into a unified, functional system that operates efficiently and reliably as a whole.",
      "chapters": [
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "systems thinking",
      "definition": "An approach to understanding complex systems by considering how individual components interact and affect the whole system, particularly important in ML where data, algorithms, hardware, and deployment environments must work together effectively.",
      "chapters": [
        "introduction",
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "systolic array",
      "definition": "A specialized hardware architecture that efficiently performs matrix operations by streaming data through a grid of processing elements, minimized data movement and energy consumption.",
      "chapters": [
        "training",
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tail latency",
      "definition": "Worst-case response times in a system, typically measured as 95th or 99th percentile latency, important for understanding system reliability under peak load conditions.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tailored inference benchmarks",
      "definition": "Specialized performance tests designed for specific deployment environments or use cases, accounting for unique constraints and optimization requirements.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tanh",
      "definition": "An activation function that maps inputs to the range (-1,1) with zero-centered output, helping to stabilize gradient-based optimization compared to sigmoid functions.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "targeted attack",
      "definition": "A type of data poisoning attack that aims to cause misclassification of specific inputs or classes while leaving the model's general performance largely intact.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "technical debt",
      "definition": "Long-term maintenance cost accumulated from expedient design decisions during development, particularly problematic in ML systems due to data dependencies and model complexity.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "telemetry",
      "definition": "Automated collection and transmission of performance data and metrics from distributed systems, enabling remote monitoring and analysis.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensor",
      "definition": "A multidimensional array that generalizes scalars, vectors, and matrices to higher dimensions, serving as the fundamental data structure in machine learning frameworks for representing and manipulating numerical data.",
      "chapters": [
        "dl_primer",
        "frameworks",
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensor decomposition",
      "definition": "The extension of matrix factorization to higher-order tensors, used to compress neural network layers by representing weight tensors as combinations of smaller tensors with fewer parameters.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensor parallelism",
      "definition": "A distributed computing technique that partitions individual tensors and operations across multiple devices, reducing per-device memory requirements while maintaining computational efficiency through coordinated parallel execution.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensor processing unit",
      "definition": "Google's custom application-specific integrated circuit designed specifically for machine learning workloads, optimized for matrix operations and featuring systolic array architecture.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensor processing unit (tpu)",
      "definition": "Google's custom ASIC designed specifically for neural network workloads, achieving significant performance and energy efficiency improvements over general-purpose processors.",
      "chapters": [
        "ml_systems",
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensorflow",
      "definition": "A comprehensive machine learning framework developed by Google that provides tools for the entire ML pipeline from research to production, featuring both eager execution and graph-based computation with extensive ecosystem support.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tensorrt",
      "definition": "NVIDIA's inference optimization library that applies techniques like operator fusion and precision reduction to accelerate deep learning inference on GPU hardware.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "ternarization",
      "definition": "An extreme quantization technique that constrains weights to three values (typically -1, 0, +1), providing significant compression while maintaining more representational capacity than binary quantization.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "test time compute",
      "definition": "Dynamic resource allocation during inference that adjusts computational effort based on task complexity or importance, enabling flexible performance-accuracy trade-offs.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "thermal stress",
      "definition": "Hardware degradation caused by repeated cycling through high and low temperatures, leading to material fatigue and potential failures.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "threshold for activation",
      "definition": "The input level at which a neuron begins to produce significant output, determined by the combination of weights, biases, and the chosen activation function, controlling when the neuron contributes to the network's computation.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "throughput",
      "definition": "The rate at which a system can process data or complete operations, typically measured in operations per second and crucial for training large models.",
      "chapters": [
        "hw_acceleration",
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "time-to-accuracy",
      "definition": "Duration required for a machine learning model to reach a predefined accuracy threshold during training, serving as a key metric for training efficiency evaluation.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tiny machine learning",
      "definition": "The execution of machine learning models on ultra-constrained devices such as microcontrollers and sensors, operating in the milliwatt to sub-watt power range.",
      "chapters": [
        "ml_systems"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tiny ml",
      "definition": "Machine learning systems designed to run on extremely resource-constrained devices like microcontrollers, typically with models under 1 MB and power consumption under 150 mW.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tinyml",
      "definition": "Machine learning on microcontrollers and edge devices with less than 1KB-1MB memory and less than 1mW power consumption, enabling AI in IoT devices where traditional deployment is impossible.",
      "chapters": [
        "efficient_ai",
        "ondevice_learning",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tokens",
      "definition": "Individual units of text that language models process, typically words or subword pieces, with modern models like GPT-3 trained on hundreds of billions of tokens.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tops",
      "definition": "Tera Operations Per Second, a measure of computational performance indicating how many trillion operations a system can execute in one second.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tpu",
      "definition": "Tensor Processing Unit, Google's custom Application-Specific Integrated Circuits (ASICs) designed specifically for accelerating tensor operations in machine learning workloads, offering significant performance and energy efficiency improvements over general-purpose processors.",
      "chapters": [
        "frameworks",
        "efficient_ai",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "training",
      "definition": "The phase of machine learning where model parameters are learned from data through iterative optimization, typically requiring high numerical precision and computational resources.",
      "chapters": [
        "dl_primer",
        "ml_systems",
        "hw_acceleration",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "training-serving skew",
      "definition": "Inconsistency between feature preprocessing logic used during model training versus serving, leading to degraded production performance.",
      "chapters": [
        "ops"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transfer learning",
      "definition": "A machine learning technique that leverages knowledge gained from pre-trained models on related tasks, allowing faster training and better performance on new tasks with limited data by reusing learned features and representations.",
      "chapters": [
        "data_engineering",
        "frameworks",
        "efficient_ai",
        "workflow",
        "ondevice_learning",
        "robust_ai",
        "sustainable_ai",
        "frontiers",
        "conclusion"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transformer",
      "definition": "Neural network architecture introduced by Vaswani et al. in 2017 that revolutionized natural language processing through attention mechanisms, forming the foundation of models like GPT, BERT, and T5.",
      "chapters": [
        "efficient_ai",
        "dnn_architectures",
        "benchmarking",
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transformer architecture",
      "definition": "A neural network architecture based on attention mechanisms that has revolutionized natural language processing and is increasingly applied to other domains like computer vision.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transient faults",
      "definition": "Temporary hardware faults that do not persist or cause permanent damage but can lead to incorrect computations if not handled properly.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "translation invariance",
      "definition": "The property of convolutional networks to recognize patterns regardless of their position in the input, achieved through weight sharing and pooling operations.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "transparency",
      "definition": "Openness about how AI systems are built, trained, validated, and deployed, including disclosure of data sources, design assumptions, and limitations.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "triple modular redundancy (tmr)",
      "definition": "A fault-tolerance technique where three instances of a computation are performed, with majority voting determining the correct result.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "trusted execution environment",
      "definition": "A secure area within a processor that provides hardware-based protection for code and data, ensuring confidentiality and integrity even from privileged system software.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tucker decomposition",
      "definition": "A tensor decomposition method that generalizes singular value decomposition to higher-order tensors using a core tensor and factor matrices, commonly used for compressing convolutional neural network layers.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tv white spaces",
      "definition": "Unused broadcasting frequencies that can be repurposed for internet connectivity, as employed by systems like FarmBeats to extend network access to remote agricultural sensors and IoT devices.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "uci machine learning repository",
      "definition": "Established in 1987 by the University of California Irvine, one of the most widely-used resources for machine learning datasets containing over 600 datasets cited in thousands of research papers.",
      "chapters": [
        "efficient_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "uniform quantization",
      "definition": "A quantization approach where the range of values is divided into evenly spaced intervals, providing simple implementation but potentially suboptimal for non-uniform value distributions.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "universal approximation theorem",
      "definition": "A theoretical result proving that neural networks with sufficient width and non-linear activation functions can approximate any continuous function on a compact domain.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "unstructured pruning",
      "definition": "A pruning approach that removes individual weights while preserving the overall network architecture, creating sparse weight matrices that require specialized hardware support to realize computational benefits.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "unstructured sparsity",
      "definition": "A form of model sparsity where individual weights are set to zero without following any particular pattern, creating irregular sparsity patterns that require specialized hardware support to realize computational benefits.",
      "chapters": [
        "optimizations"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "validation issues",
      "definition": "Problems identified during model testing that indicate poor performance, overfitting, data quality problems, or other issues that must be resolved before deployment.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "value alignment",
      "definition": "The principle that AI systems should pursue goals consistent with human intent and ethical norms, addressing the challenge of encoding human values in machine objectives.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "value-sensitive design",
      "definition": "A methodology for incorporating human values into technology design through systematic stakeholder engagement and ethical consideration of system impacts.",
      "chapters": [
        "responsible_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "vanishing gradient",
      "definition": "A problem in deep neural networks where gradients become exponentially smaller as they propagate backward through layers, making it difficult for early layers to learn effectively.",
      "chapters": [
        "dl_primer",
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "vanishing gradient problem",
      "definition": "A challenge in training deep neural networks where gradients become exponentially smaller as they propagate backward through layers, making it difficult to train early layers effectively.",
      "chapters": [
        "training"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "vector operations",
      "definition": "Computational operations that process multiple data elements simultaneously, enabling efficient parallel execution of element-wise transformations in neural networks.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "vector-borne diseases",
      "definition": "Diseases transmitted by insects or other vectors, such as malaria carried by mosquitoes, which can be monitored and controlled using machine learning-powered detection systems.",
      "chapters": [
        "ai_for_good"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "versioning",
      "definition": "The practice of tracking changes to datasets, models, and pipelines over time, enabling reproducibility, rollback capabilities, and audit trails in ML systems.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "virtuous cycle",
      "definition": "The self-reinforcing process in deep learning where improvements in data availability, algorithms, and computing power each enable further advances in the other areas, accelerating overall progress.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "vision-language models",
      "definition": "AI systems that can understand and reason about both visual and textual information simultaneously, enabling tasks like image captioning, visual question answering, and multimodal understanding.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "von neumann bottleneck",
      "definition": "The performance limitation caused by the shared bus between processor and memory in traditional computer architectures, where data movement becomes more expensive than computation.",
      "chapters": [
        "hw_acceleration"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "watchdog timer",
      "definition": "A hardware component that monitors system execution and triggers recovery actions if the system becomes unresponsive or stuck.",
      "chapters": [
        "robust_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "water usage effectiveness",
      "definition": "A metric that measures the efficiency of water use in data centers, calculated as the ratio of total water consumed to IT equipment energy consumption.",
      "chapters": [
        "sustainable_ai"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "waymo",
      "definition": "A subsidiary of Alphabet Inc. that represents one of the most ambitious applications of machine learning systems in autonomous vehicle technology, demonstrating how ML systems can span from embedded systems to cloud infrastructure in safety-critical environments.",
      "chapters": [
        "introduction"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "weak supervision",
      "definition": "An approach that uses lower-quality labels obtained more efficiently through heuristics, distant supervision, or programmatic methods rather than manual expert annotation.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "web scraping",
      "definition": "An automated technique for extracting data from websites to build custom datasets, requiring careful consideration of legal, ethical, and technical constraints.",
      "chapters": [
        "data_engineering"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "weight",
      "definition": "A learnable parameter that determines the strength of connection between neurons in different layers, adjusted during training to minimize the loss function.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "weight freezing",
      "definition": "A technique that fixes most model parameters during training while allowing only specific layers or components to be updated, reducing computational requirements for on-device adaptation.",
      "chapters": [
        "ondevice_learning"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "weight matrix",
      "definition": "An organized collection of weights connecting one layer to another in a neural network, enabling efficient computation through matrix operations.",
      "chapters": [
        "dl_primer"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "weight sharing",
      "definition": "The practice of using the same parameters across different spatial locations, as in convolutional networks, reducing the number of parameters while maintaining pattern detection capabilities.",
      "chapters": [
        "dnn_architectures"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "whetstone",
      "definition": "Early benchmark introduced in 1964 that measured floating-point arithmetic performance in KIPS (thousands of instructions per second), becoming the first widely-adopted standardized performance test.",
      "chapters": [
        "benchmarking"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "white-box attack",
      "definition": "An adversarial attack where the attacker has complete knowledge of the model's architecture, parameters, training data, and internal workings, enabling highly effective attack strategies.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "workflow orchestration",
      "definition": "Automated coordination and management of complex ML pipeline sequences, ensuring proper execution order, dependency management, and error handling across distributed systems.",
      "chapters": [
        "workflow"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "xla",
      "definition": "Accelerated Linear Algebra, a domain-specific compiler for linear algebra operations that optimizes TensorFlow and JAX computations by generating efficient code for various hardware platforms including CPUs, GPUs, and TPUs.",
      "chapters": [
        "frameworks"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "zero-day vulnerability",
      "definition": "A previously unknown security flaw in software or hardware that can be exploited by attackers before developers have had a chance to create and distribute a patch.",
      "chapters": [
        "privacy_security"
      ],
      "aliases": [],
      "see_also": []
    },
    {
      "term": "zero-shot learning",
      "definition": "The ability of machine learning models to perform tasks or classify objects they have never seen during training, often achieved through sophisticated representation learning or large-scale pre-training.",
      "chapters": [
        "frontiers"
      ],
      "aliases": [],
      "see_also": []
    }
  ]
}
