{
  "metadata": {
    "chapter": "introduction",
    "version": "1.0.1",
    "generated": "2025-09-15T14:08:03.498648",
    "total_terms": 37,
    "standardized": true,
    "last_updated": "2026-01-11T00:00:00.000000"
  },
  "terms": [
    {
      "term": "ai triad",
      "definition": "A framework modeling ML systems as three interdependent components: data that guides behavior, algorithms that learn patterns, and computational infrastructure that enables training and inference. Limitations in any component constrain the capabilities of the others.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["ml systems"]
    },
    {
      "term": "alexnet",
      "definition": "A breakthrough deep neural network from 2012 that won the ImageNet competition by a large margin and helped spark the deep learning revolution, proving that neural networks could outperform traditional computer vision methods when given enough data and computing power.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["imagenet"]
    },
    {
      "term": "alphafold",
      "definition": "A landmark AI system developed by DeepMind that predicts the three-dimensional structure of proteins from their amino acid sequences, solving the decades-old protein folding problem and demonstrating how large-scale ML systems can accelerate scientific discovery.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["protein folding problem"]
    },
    {
      "term": "artificial intelligence",
      "definition": "The systematic pursuit of understanding and replicating intelligent behavior through the development of computer systems that can perform tasks typically requiring human intelligence, such as learning, problem-solving, perception, and decision-making.",
      "chapter_source": "introduction",
      "aliases": ["AI"],
      "see_also": ["machine learning"]
    },
    {
      "term": "artificial neurons",
      "definition": "Basic computational units in neural networks that mimic biological neurons, taking multiple inputs, applying weights and biases, and producing an output signal through an activation function.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "bitter lesson",
      "definition": "Richard Sutton's 2019 observation that general methods leveraging computation consistently outperform approaches encoding human expertise, suggesting that systems engineering enabling computational scale is central to AI advancement.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "black box",
      "definition": "A system where you can observe the inputs and outputs but cannot see or understand the internal workings, particularly problematic in AI when systems make important decisions affecting people's lives without providing explanations for their reasoning.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "brittleness",
      "definition": "The tendency of rule-based AI systems to fail completely when encountering inputs that fall outside their programmed scenarios, no matter how similar those inputs might be to what they were designed to handle.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["symbolic ai"]
    },
    {
      "term": "computer engineering",
      "definition": "An engineering discipline that emerged in the late 1960s to address the growing complexity of integrating hardware and software systems, combining expertise from electrical engineering and computer science to design and build complex computing systems.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "connectionism",
      "definition": "An approach to AI modeling that emphasizes learning and intelligence emerging from simple interconnected units, serving as the theoretical foundation for neural networks and contrasting with symbolic AI approaches.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["symbolic ai"]
    },
    {
      "term": "dartmouth conference",
      "definition": "The legendary 8-week workshop at Dartmouth College in 1956 where AI was officially born, organized by John McCarthy, Marvin Minsky, Nathaniel Rochester, and Claude Shannon, where the term artificial intelligence was first coined.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "distribution shift",
      "definition": "A change in the statistical properties of data between training and deployment, or over time during deployment. Types include covariate shift (input distribution changes), label shift (output distribution changes), and concept drift (relationship between inputs and outputs changes).",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["silent degradation"]
    },
    {
      "term": "eliza",
      "definition": "One of the first chatbots created by MIT's Joseph Weizenbaum in 1966 that could simulate human conversation through pattern matching and substitution, notable because people began forming emotional attachments to this simple program.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "expert systems",
      "definition": "AI systems from the mid-1970s that captured human expert knowledge in specific domains, exemplified by MYCIN for diagnosing blood infections, representing a shift from general AI to domain-specific applications.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["mycin", "symbolic ai"]
    },
    {
      "term": "farmbeats",
      "definition": "A Microsoft Research project that applies machine learning and IoT technologies to agriculture, using edge computing to collect real-time data on soil conditions and crop health while demonstrating distributed AI systems in challenging real-world environments.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "five-pillar framework",
      "definition": "An organizational structure for ML systems engineering comprising five interconnected disciplines: Data Engineering, Training Systems, Deployment Infrastructure, Operations and Monitoring, and Ethics and Governance.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["machine learning systems engineering"]
    },
    {
      "term": "generalization gap",
      "definition": "The difference between a model's performance on training data and its performance on unseen real-world data. A large generalization gap indicates the model has memorized training examples rather than learning transferable patterns.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "imagenet",
      "definition": "A massive visual database containing over 14 million labeled images across 20,000+ categories, created by Stanford's Fei-Fei Li starting in 2009, whose annual challenge became instrumental in driving breakthrough advances in computer vision.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["alexnet"]
    },
    {
      "term": "machine learning",
      "definition": "The methodological approach to implementing intelligent systems through computational techniques that automatically discover patterns in data, rather than through predetermined rules or explicit programming.",
      "chapter_source": "introduction",
      "aliases": ["ML"],
      "see_also": ["artificial intelligence"]
    },
    {
      "term": "machine learning systems engineering",
      "definition": "The engineering discipline focused on building reliable, efficient, and scalable AI systems across computational platforms, spanning the entire AI lifecycle from data acquisition through deployment and operations with emphasis on resource-awareness and system-level optimization.",
      "chapter_source": "introduction",
      "aliases": ["ML systems engineering", "AI engineering"],
      "see_also": ["ai triad", "five-pillar framework"]
    },
    {
      "term": "ml lifecycle",
      "definition": "The comprehensive process of developing, deploying, and maintaining machine learning systems, encompassing data collection, model development, training, evaluation, deployment, monitoring, and iterative improvement with continuous feedback loops.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "ml systems",
      "definition": "Integrated computing systems comprising three core components: data that guides algorithmic behavior, learning algorithms that extract patterns from data, and computing infrastructure that enables both training and inference processes.",
      "chapter_source": "introduction",
      "aliases": ["machine learning systems"],
      "see_also": ["ai triad"]
    },
    {
      "term": "mycin",
      "definition": "One of the first large-scale expert systems developed at Stanford in 1976 to diagnose blood infections, representing the shift toward capturing human expert knowledge in specific domains rather than pursuing general artificial intelligence.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["expert systems"]
    },
    {
      "term": "paradigm shift",
      "definition": "A fundamental change in scientific approach, like the shift from symbolic reasoning to statistical learning in AI during the 1990s, and from shallow to deep learning in the 2010s, requiring researchers to abandon established methods for radically different approaches.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "perceptron",
      "definition": "One of the first computational learning algorithms developed by Frank Rosenblatt in 1957, a system that could learn to classify patterns by making yes/no decisions based on inputs, paving the way for modern neural networks.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "protein folding problem",
      "definition": "The scientific challenge of predicting the three-dimensional structure of proteins from their amino acid sequences, a problem that puzzled scientists for decades until systems like AlphaFold achieved breakthrough accuracy using deep learning approaches.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["alphafold"]
    },
    {
      "term": "sequential neural networks",
      "definition": "Neural network architectures designed to process data that occurs in sequences over time, maintaining a form of memory of previous inputs to inform current decisions, essential for tasks like predicting pedestrian movement patterns.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "shallow learning",
      "definition": "Machine learning approaches that use algorithms with limited complexity, such as support vector machines and decision trees, which require carefully engineered features but cannot automatically discover hierarchical representations like deep learning methods.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["statistical learning"]
    },
    {
      "term": "silent degradation",
      "definition": "The gradual decline in ML system performance that occurs without triggering errors, exceptions, or alerts. Unlike traditional software that crashes observably, ML systems can continue operating while producing increasingly inaccurate predictions.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["distribution shift"]
    },
    {
      "term": "statistical learning",
      "definition": "The era of machine learning that emerged in the 1990s, shifting focus from rule-based symbolic AI to algorithms that could learn patterns from data, laying the groundwork for modern data-driven approaches to artificial intelligence.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["shallow learning"]
    },
    {
      "term": "student system",
      "definition": "One of the first AI programs from 1964 by Daniel Bobrow that demonstrated natural language understanding by converting English algebra word problems into mathematical equations, marking an important milestone in symbolic AI.",
      "chapter_source": "introduction",
      "aliases": ["STUDENT"],
      "see_also": ["symbolic ai"]
    },
    {
      "term": "symbolic ai",
      "definition": "An approach to artificial intelligence that uses high-level symbolic representations of problems, logic, and search algorithms, dominant before the deep learning revolution and characterized by expert systems and rule-based reasoning.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["expert systems", "connectionism"]
    },
    {
      "term": "systems thinking",
      "definition": "An approach to understanding complex systems by considering how individual components interact and affect the whole system, particularly important in ML where data, algorithms, hardware, and deployment environments must work together effectively.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["ai triad"]
    },
    {
      "term": "training-serving skew",
      "definition": "A mismatch between how features or data are computed during model training versus serving in production, causing model performance to degrade despite unchanged code. Common causes include different preprocessing pipelines, feature computation timing, or data sources between training and inference.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["silent degradation"]
    },
    {
      "term": "transfer learning",
      "definition": "The technique of reusing a model trained on one task as the starting point for learning a related task, dramatically reducing the data and computation required for the new task.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    },
    {
      "term": "tv white spaces",
      "definition": "Unused broadcasting frequencies that can be repurposed for internet connectivity, as employed by systems like FarmBeats to extend network access to remote agricultural sensors and IoT devices.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": ["farmbeats"]
    },
    {
      "term": "waymo",
      "definition": "A subsidiary of Alphabet Inc. that represents a leading deployment of machine learning systems in autonomous vehicle technology, demonstrating how ML systems can span from embedded systems to cloud infrastructure in safety-critical environments.",
      "chapter_source": "introduction",
      "aliases": [],
      "see_also": []
    }
  ]
}
